[
  {
    "id": 1,
    "category": "Tonggi",
    "title": "Uyqudan uyg'onganda",
    "narrator_intro": "Huzaifa (r.a)dan rivoyat qilinadi:",
    "arabic": "الْحَمْدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "transcription": "Al-hamdu lillaahil-lazii ahyaanaa ba'da maa amaatanaa va ilayhin-nushuur",
    "translation": "Bizni o'ldirgandan (uxlatgandan) keyin yana qayta tiriltirgan (uyg'otgan) Allohga hamd bo'lsin. Va qaytish faqat Uning huzurigadir.",
    "reference": "Buxoriy",
    "title_en": "Upon Waking Up",
    "title_ar": "دعاء الاستيقاظ من النوم",
    "title_id": "Doa Bangun Tidur",
    "narrator_intro_en": "Narrated by Hudhayfah (RA):",
    "narrator_intro_ar": "عن حذيفة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Hudzaifah (RA):",
    "translation_en": "All praise is due to Allah, who gave us life after causing us to die, and unto Him is the resurrection.",
    "translation_ar": "الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور. أي: الذي أيقظنا بعد النوم الذي هو أخو الموت.",
    "translation_id": "Segala puji bagi Allah yang menghidupkan kami setelah mematikan kami, dan kepada-Nya kami dikembalikan."
  },
  {
    "id": 2,
    "category": "Tonggi",
    "title": "Sayyidul istig'for",
    "narrator_intro": "Shaddod ibn Avs (r.a)dan rivoyat:",
    "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتطعتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "transcription": "Allohumma anta robbiy laa ilaaha illaa ant. Xolaqtaniy va ana 'abduk. Va ana 'alaa 'ahdika va va'dika mastato'tu. A'uzu bika min sharri maa sona'tu. Abuu'u laka bini'matika 'alayya, va abuu'u bizambiy fag'firliy fa innahuu laa yag'firuz-zunuuba illaa ant",
    "translation": "Allohim! Sen mening Robbimdirsan. Sendan o'zga iloh yo'q. Meni Sen yaratgansan va men Sening qulingman. Qurbim yetganicha Sening ahding va va'dangdaman. Qilganlarimning yomonligidan Sendan panoh tilayman. Menga bergan ne'mating va gunohlarimni o'z zimmamga olaman (tan olaman). Meni mag'firat qil (kechir). Zero gunohlarni faqat Sen kechirasan.",
    "reference": "Buxoriy",
    "title_en": "Sayyid al-Istighfar (Master Supplication)",
    "title_ar": "سيد الاستغفار",
    "title_id": "Sayyidul Istighfar",
    "narrator_intro_en": "Narrated by Shaddad ibn Aws (RA):",
    "narrator_intro_ar": "عن شداد بن أوس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Syaddad bin Aus (RA):",
    "translation_en": "O Allah, You are my Lord. There is no god but You. You created me and I am Your servant. I abide by Your covenant and promise as best I can. I seek refuge in You from the evil I have done. I acknowledge Your blessings upon me and I acknowledge my sins. So forgive me, for none forgives sins but You.",
    "translation_ar": "هذا أفضل الاستغفار. من قاله حين يُمسي ثم مات دخل الجنة، ومن قاله حين يُصبح ثم مات دخل الجنة.",
    "translation_id": "Ya Allah, Engkau adalah Tuhanku. Tidak ada tuhan selain Engkau. Engkau menciptakanku dan aku hamba-Mu. Aku berpegang pada perjanjian-Mu semampuku. Aku berlindung kepada-Mu dari keburukan yang kuperbuat. Aku mengakui nikmat-Mu dan mengakui dosaku, maka ampunilah aku, karena tidak ada yang mengampuni dosa kecuali Engkau."
  },
  {
    "id": 3,
    "category": "Tonggi",
    "title": "Tongda ofiyat so'rash",
    "narrator_intro": "Ibn Umar (r.a)dan rivoyat:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
    "transcription": "Alloohumma innii as'alukal-'aafiyata fid-dunyaa val-aaxiroh",
    "translation": "Ey Allohim! Men Sendan dunyo va oxiratda ofiyat (sog'lik, tinchlik, omonlik) so'rayman.",
    "reference": "Abu Dovud",
    "title_en": "Asking for Well-being in Morning",
    "title_ar": "دعاء طلب العافية",
    "title_id": "Doa Memohon Keselamatan",
    "narrator_intro_en": "Narrated by Ibn Umar (RA):",
    "narrator_intro_ar": "عن ابن عمر رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Umar (RA):",
    "translation_en": "O Allah, I ask You for well-being in this world and the Hereafter.",
    "translation_ar": "اللهم إني أسألك العافية في الدنيا والآخرة.",
    "translation_id": "Ya Allah, aku memohon kepada-Mu keselamatan di dunia dan akhirat."
  },
  {
    "id": 4,
    "category": "Tonggi",
    "title": "Himoya duosi (3 marta)",
    "narrator_intro": "Usmon (r.a)dan rivoyat:",
    "arabic": "بِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "transcription": "Bismillaahil-lazii laa yazurru ma'as-mihii shay'un fil-arzi va laa fis-samaai va huvas-samii'ul-'aliim",
    "translation": "Allohning ismi bilan. Uning ismi bilan yeru osmonda hech narsa zarar yetkaza olmaydi. U eshituvchi va biluvchidir.",
    "reference": "Termiziy",
    "title_en": "Protection Dua (3 times)",
    "title_ar": "دعاء الحماية (3 مرات)",
    "title_id": "Doa Perlindungan (3 kali)",
    "narrator_intro_en": "Narrated by Uthman (RA):",
    "narrator_intro_ar": "عن عثمان رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Utsman (RA):",
    "translation_en": "In the Name of Allah, with whose Name nothing on earth or in heaven can cause harm. He is the All-Hearing, the All-Knowing.",
    "translation_ar": "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم.",
    "translation_id": "Dengan nama Allah yang dengan nama-Nya tidak ada sesuatu pun di bumi maupun di langit yang membahayakan. Dia Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "id": 5,
    "category": "Tonggi",
    "title": "Tong ottirganda aytiladigan",
    "narrator_intro": "Abu Hurayra (r.a)dan rivoyat:",
    "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
    "transcription": "Allohumma bika asbahnaa va bika amsaynaa va bika nahyaa va bika namuutu va ilaykan-nushuur",
    "translation": "Allohim, Sening noming bilan tong ottirdik, Sening noming bilan kechga kirdik. Sening noming bilan yashaymiz, Sening noming bilan vafot etamiz. Qaytish Sengadir.",
    "reference": "Termiziy",
    "title_en": "Morning Remembrance",
    "title_ar": "ذكر الصباح",
    "title_id": "Dzikir Pagi",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "O Allah, by Your grace we have reached the morning, by Your grace we reach the evening, by Your grace we live and die, and unto You is the resurrection.",
    "translation_ar": "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور.",
    "translation_id": "Ya Allah, dengan rahmat-Mu kami memasuki pagi, dengan rahmat-Mu kami memasuki sore, dengan rahmat-Mu kami hidup dan mati, dan kepada-Mu kami dikembalikan."
  },
  {
    "id": 6,
    "category": "Tonggi",
    "title": "Tongda tavhid kalimasi (10 marta)",
    "narrator_intro": "Abu Ayyub al-Ansoriy (r.a)dan:",
    "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "transcription": "Laa ilaaha illallohu vahdahuu laa shariika lah. Lahul mulku va lahul hamdu, yuhyii va yumiitu va huva 'alaa kulli shay'in qodiyr",
    "translation": "Yagona va sheriksiz Allohdan o'zga haq ma'bud yo'q. Mulk ham Uniki, hamd ham Unikidir. U tiriltiradi va o'ldiradi. Va U barcha narsaga qodirdir.",
    "reference": "Buxoriy",
    "title_en": "Tawheed Declaration (10 times)",
    "title_ar": "كلمة التوحيد (10 مرات)",
    "title_id": "Kalimah Tauhid (10 kali)",
    "narrator_intro_en": "Narrated by Abu Ayyub al-Ansari (RA):",
    "narrator_intro_ar": "عن أبي أيوب الأنصاري رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Ayyub al-Anshari (RA):",
    "translation_en": "There is no god but Allah alone, with no partner. His is the dominion and His is the praise. He gives life and causes death, and He has power over all things.",
    "translation_ar": "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير.",
    "translation_id": "Tiada tuhan selain Allah semata, tidak ada sekutu bagi-Nya. Milik-Nya kerajaan dan pujian. Dia menghidupkan dan mematikan, dan Dia Mahakuasa atas segala sesuatu."
  },
  {
    "id": 7,
    "category": "Kechki",
    "title": "Kechqurungi zikr",
    "narrator_intro": "Abu Hurayra (r.a)dan rivoyat:",
    "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
    "transcription": "Amsaynaa va amsal-mulku lillaahi val-hamdu lillaah, laa ilaaha illalloohu vahdahuu laa shariika lah",
    "translation": "Biz ham, barcha mulk ham Allohga tegishli holda kechga kirdik. Allohga hamd bo'lsin. Yagona va sherigi yo'q Allohdan o'zga iloh yo'q.",
    "reference": "Muslim",
    "title_en": "Evening Remembrance",
    "title_ar": "ذكر المساء",
    "title_id": "Dzikir Sore",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "We have reached the evening and the dominion belongs to Allah. Praise is for Allah. There is no god but Allah alone, with no partner.",
    "translation_ar": "أمسينا وأمسى الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له.",
    "translation_id": "Kami memasuki sore dan kerajaan milik Allah. Segala puji bagi Allah. Tiada tuhan selain Allah semata, tiada sekutu bagi-Nya."
  },
  {
    "id": 8,
    "category": "Kechki",
    "title": "Kech qirganda aytiladigan",
    "narrator_intro": "Abu Hurayra (r.a)dan:",
    "arabic": "اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ",
    "transcription": "Allohumma bika amsaynaa va bika asbahnaa va bika nahyaa va bika namuutu va ilaykal-masiyr",
    "translation": "Allohim! Sening noming bilan kechga kirdik, Sening noming bilan tong ottirdik, Sening noming bilan yashaymiz, Sening noming bilan vafot etamiz. Boradigan joyimiz Sening huzuringdir.",
    "reference": "Termiziy",
    "title_en": "Evening Supplication",
    "title_ar": "دعاء المساء",
    "title_id": "Doa Petang",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "O Allah, by Your grace we reach the evening, by Your grace we reach the morning, by Your grace we live and die, and unto You is the return.",
    "translation_ar": "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير.",
    "translation_id": "Ya Allah, dengan rahmat-Mu kami memasuki sore, dengan rahmat-Mu kami memasuki pagi, dengan rahmat-Mu kami hidup dan mati, dan kepada-Mu tempat kembali."
  },
  {
    "id": 9,
    "category": "Kechki",
    "title": "Uxlashdan oldin",
    "narrator_intro": "Rasululloh (s.a.v) odatlari:",
    "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
    "transcription": "Bismikalloohumma amuutu va ahyaa",
    "translation": "Ey Allohim! Sening isming bilan vafot etaman (uxlayman) va tirilaman (uyg'onaman).",
    "reference": "Buxoriy",
    "title_en": "Before Sleeping",
    "title_ar": "عند النوم",
    "title_id": "Sebelum Tidur",
    "narrator_intro_en": "From the practice of the Prophet (PBUH):",
    "narrator_intro_ar": "من سنة رسول الله ﷺ:",
    "narrator_intro_id": "Dari kebiasaan Rasulullah (SAW):",
    "translation_en": "In Your Name, O Allah, I die and I live.",
    "translation_ar": "باسمك اللهم أموت وأحيا.",
    "translation_id": "Dengan nama-Mu ya Allah, aku mati dan aku hidup."
  },
  {
    "id": 10,
    "category": "Kechki",
    "title": "Uxlayotganda Ofiyat so'rash",
    "narrator_intro": "Abdulloh ibn Umar (r.a)dan:",
    "arabic": "اللَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا",
    "transcription": "Alloohumma xolaqta nafsiy va anta tavaffoohaa, laka mamaatuhaa va mahyaahaa",
    "translation": "Allohim, nafsumni Sen yaratding, uni O'zing o'ldirasan. Uning o'limi ham, hayoti ham Sening qo'lingdadir.",
    "reference": "Muslim",
    "title_en": "Asking for Wellbeing Before Sleep",
    "title_ar": "طلب العافية عند النوم",
    "title_id": "Memohon Keselamatan Sebelum Tidur",
    "narrator_intro_en": "Narrated by Abdullah ibn Umar (RA):",
    "narrator_intro_ar": "عن عبد الله بن عمر رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Abdullah bin Umar (RA):",
    "translation_en": "O Allah, You created my soul and You take it. To You belongs its death and its life.",
    "translation_ar": "اللهم خلقت نفسي وأنت توفاها لك مماتها ومحياها.",
    "translation_id": "Ya Allah, Engkau menciptakan jiwaku dan Engkau yang mewafatkannya. Milik-Mu kematiannya dan kehidupannya."
  },
  {
    "id": 11,
    "category": "Kechki",
    "title": "Batafsil istiaz (yomon tush ko'rganda)",
    "narrator_intro": "Amr ibn Shu'ayb otasidan rivoyat:",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ",
    "transcription": "A'uuzu bikalimaatillaahit-taammaati min g'ozobihii va 'iqoobihii va sharri 'ibaadih",
    "translation": "Allohning mukammal kalimalari orqali Uning g'azabidan, jazolashidan va bandalarining yomonligidan panoh tilayman.",
    "reference": "Termiziy",
    "title_en": "Seeking Refuge from Bad Dreams",
    "title_ar": "الاستعاذة عند الفزع",
    "title_id": "Berlindung dari Mimpi Buruk",
    "narrator_intro_en": "Narrated by Amr ibn Shuayb from his father:",
    "narrator_intro_ar": "عن عمرو بن شعيب عن أبيه:",
    "narrator_intro_id": "Diriwayatkan oleh Amr bin Syuaib dari ayahnya:",
    "translation_en": "I seek refuge in the perfect words of Allah from His anger, His punishment, and the evil of His servants.",
    "translation_ar": "أعوذ بكلمات الله التامات من غضبه وعقابه وشر عباده.",
    "translation_id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari murka-Nya, siksa-Nya, dan keburukan hamba-hamba-Nya."
  },
  {
    "id": 12,
    "category": "Namoz",
    "title": "Masjidga kirishda",
    "narrator_intro": "Abu Humayd as-So'idiy (r.a)dan:",
    "arabic": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
    "transcription": "Alloohummaf-tah lii abvaaba rohmatik",
    "translation": "Ey Allohim! Menga rahmating eshiklarini ochgin.",
    "reference": "Muslim",
    "title_en": "Entering the Mosque",
    "title_ar": "دعاء دخول المسجد",
    "title_id": "Doa Masuk Masjid",
    "narrator_intro_en": "Narrated by Abu Humayd as-Saidi (RA):",
    "narrator_intro_ar": "عن أبي حميد الساعدي رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Humaid as-Saidi (RA):",
    "translation_en": "O Allah, open for me the doors of Your mercy.",
    "translation_ar": "اللهم افتح لي أبواب رحمتك.",
    "translation_id": "Ya Allah, bukakanlah untukku pintu-pintu rahmat-Mu."
  },
  {
    "id": 13,
    "category": "Namoz",
    "title": "Masjiddan chiqishda",
    "narrator_intro": "Abu Humayd as-So'idiy (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
    "transcription": "Alloohumma innii as'aluka min fazlik",
    "translation": "Allohim, albatta, men Sendan fazlingni (boyligingni) so'rayman.",
    "reference": "Muslim",
    "title_en": "Leaving the Mosque",
    "title_ar": "دعاء الخروج من المسجد",
    "title_id": "Doa Keluar Masjid",
    "narrator_intro_en": "Narrated by Abu Humayd as-Saidi (RA):",
    "narrator_intro_ar": "عن أبي حميد الساعدي رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Humaid as-Saidi (RA):",
    "translation_en": "O Allah, I ask You of Your bounty.",
    "translation_ar": "اللهم إني أسألك من فضلك.",
    "translation_id": "Ya Allah, aku memohon kepada-Mu dari karunia-Mu."
  },
  {
    "id": 14,
    "category": "Namoz",
    "title": "Azonni eshitgandan so'ng",
    "narrator_intro": "Jobir (r.a)dan:",
    "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
    "transcription": "Alloohumma robba haazihid-da'vatit-taammah. Vas-solaatil-qoimah, aati muhammadanil-vasiilata val-faziilah. Vab'ashu maqoomam mahmuudanil-lazii va'adtah",
    "translation": "Ey ushbu komil da'vatning va qoim bo'ladigan namozning Robbi! Muhammad (s.a.v)ga vasila va fazilatni ato etgin. Uni O'zing va'da qilgan maqomi mahmud (maqtovli o'rin)da tiriltirgin.",
    "reference": "Buxoriy",
    "title_en": "After Hearing the Adhan",
    "title_ar": "الدعاء بعد الأذان",
    "title_id": "Doa Setelah Mendengar Adzan",
    "narrator_intro_en": "Narrated by Jabir (RA):",
    "narrator_intro_ar": "عن جابر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Jabir (RA):",
    "translation_en": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the intercession and the virtue, and raise him to the praised station that You have promised him.",
    "translation_ar": "اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمداً الوسيلة والفضيلة وابعثه مقاماً محموداً الذي وعدته.",
    "translation_id": "Ya Allah, Tuhan pemilik seruan yang sempurna dan shalat yang ditegakkan ini, berikanlah kepada Muhammad wasilah dan keutamaan, dan bangkitkanlah beliau ke tempat terpuji yang telah Engkau janjikan."
  },
  {
    "id": 15,
    "category": "Namoz",
    "title": "Tahoratdan so'ng",
    "narrator_intro": "Umar ibn Xattob (r.a)dan:",
    "arabic": "أَشْهدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
    "transcription": "Ash-hadu alla ilaaha illalloohu vahdahu laa shariika lah. Va ash-hadu anna Muhammadan 'abduhuu va rosuuluh",
    "translation": "Yagona va sheriksiz Allohdan o'zga haq iloh yo'qligiga hamda Muhammad Uning quli va elchisi ekaniga guvohlik beraman.",
    "reference": "Muslim",
    "title_en": "After Wudu (Ablution)",
    "title_ar": "بعد الوضوء",
    "title_id": "Setelah Wudhu",
    "narrator_intro_en": "Narrated by Umar ibn al-Khattab (RA):",
    "narrator_intro_ar": "عن عمر بن الخطاب رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Umar bin Khattab (RA):",
    "translation_en": "I bear witness that there is no god but Allah alone without partner, and I bear witness that Muhammad is His servant and messenger.",
    "translation_ar": "أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمداً عبده ورسوله.",
    "translation_id": "Aku bersaksi bahwa tiada tuhan selain Allah semata, tiada sekutu bagi-Nya, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya."
  },
  {
    "id": 16,
    "category": "Namoz",
    "title": "Tahorat zikri qismi (qosimcha)",
    "narrator_intro": "Umar ibn Xattob (r.a)dan qo'shimcha:",
    "arabic": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
    "transcription": "Alloohummaj'alnii minat-tavvaabiina vaj'alnii minal mutatoh-hiriin",
    "translation": "Allohim! Meni ko'p tavba qiluvchilardan va o'zini pok tutuvchilardan qilgin.",
    "reference": "Termiziy",
    "title_en": "Additional Wudu Supplication",
    "title_ar": "دعاء إضافي بعد الوضوء",
    "title_id": "Doa Tambahan Setelah Wudhu",
    "narrator_intro_en": "Additional from Umar ibn al-Khattab (RA):",
    "narrator_intro_ar": "إضافة من عمر بن الخطاب رضي الله عنه:",
    "narrator_intro_id": "Tambahan dari Umar bin Khattab (RA):",
    "translation_en": "O Allah, make me among those who repent and make me among those who purify themselves.",
    "translation_ar": "اللهم اجعلني من التوابين واجعلني من المتطهرين.",
    "translation_id": "Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang yang menyucikan diri."
  },
  {
    "id": 17,
    "category": "Namoz",
    "title": "Namoz ichida sano",
    "narrator_intro": "Oisha (r.a)dan:",
    "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرُكَ",
    "transcription": "Subhaanakalloohumma va bihamdik, va tabaarokas-muk, va ta'aalaa jad-duk, va laa ilaaha g'oyruk",
    "translation": "Ey Allohim! Sen barcha nuqsonlardan poksan, Senga hamd bo'lsin. Isming barakotlidir. Shoning (buyukliging) oliydir. Sendan o'zga haq iloh yo'qdir.",
    "reference": "Termiziy va Abu Dovud",
    "title_en": "Opening Supplication in Prayer (Thana)",
    "title_ar": "دعاء الاستفتاح (الثناء)",
    "title_id": "Doa Iftitah dalam Shalat",
    "narrator_intro_en": "Narrated by Aisha (RA):",
    "narrator_intro_ar": "عن عائشة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Aisyah (RA):",
    "translation_en": "Glory be to You, O Allah, and praise be to You. Blessed is Your Name, exalted is Your Majesty, and there is no god other than You.",
    "translation_ar": "سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك.",
    "translation_id": "Mahasuci Engkau ya Allah, dan segala puji bagi-Mu. Maha berkah nama-Mu, Maha tinggi kemuliaan-Mu, dan tiada tuhan selain Engkau."
  },
  {
    "id": 18,
    "category": "Namoz",
    "title": "Ruku va sajdalar orasida",
    "narrator_intro": "Huzayfa (r.a)dan:",
    "arabic": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
    "transcription": "Robbiyg'fir lii, Robbiyg'fir lii",
    "translation": "Robbim, meni mag'firat qil! Robbim, meni mag'firat qil!",
    "reference": "Abu Dovud",
    "title_en": "Between Ruku and Sujud",
    "title_ar": "بين الركوع والسجود",
    "title_id": "Antara Rukuk dan Sujud",
    "narrator_intro_en": "Narrated by Hudhayfah (RA):",
    "narrator_intro_ar": "عن حذيفة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Hudzaifah (RA):",
    "translation_en": "My Lord, forgive me. My Lord, forgive me.",
    "translation_ar": "ربي اغفر لي ربي اغفر لي.",
    "translation_id": "Tuhanku, ampunilah aku. Tuhanku, ampunilah aku."
  },
  {
    "id": 19,
    "category": "Namoz",
    "title": "Tashahhud (Attahiyyat)",
    "narrator_intro": "Ibn Mas'ud (r.a)dan:",
    "arabic": "التَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
    "transcription": "At-tahiyyaatu lillaahi vas-solavaatu vat-toyyibaat. As-salaamu 'alayka ayyuhan-nabiyyu va rohmatullaahi va barokaatuh...",
    "translation": "Barcha tildagi (salomlar), o'qiladigan va qilinadigan go'zal ibodatlar faqat Allohgadir. Ey Nabiy, sizga Allohning salomi, rahmati va barakotlari bo'lsin...",
    "reference": "Buxoriy",
    "title_en": "Tashahhud (At-Tahiyyat)",
    "title_ar": "التشهد (التحيات)",
    "title_id": "Tasyahhud (At-Tahiyyat)",
    "narrator_intro_en": "Narrated by Ibn Masud (RA):",
    "narrator_intro_ar": "عن ابن مسعود رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Masud (RA):",
    "translation_en": "All greetings, prayers, and good deeds are for Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings...",
    "translation_ar": "التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته.",
    "translation_id": "Segala penghormatan, shalawat, dan kebaikan hanya milik Allah. Salam sejahtera atas engkau wahai Nabi, serta rahmat dan berkah Allah..."
  },
  {
    "id": 20,
    "category": "Kundalik",
    "title": "Xojatxonaga kirishda",
    "narrator_intro": "Anas (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
    "transcription": "Alloohumma innii a'uuzu bika minal-xubsi val-xobaa'is",
    "translation": "Ey Allohim! Jinlarning erkagu urg'ochisi (yoki barcha yomonlik va yomon narsalar) yomonligidan panoh tilayman.",
    "reference": "Buxoriy va Muslim",
    "title_en": "Entering the Toilet",
    "title_ar": "دعاء دخول الخلاء",
    "title_id": "Doa Masuk Kamar Mandi",
    "narrator_intro_en": "Narrated by Anas (RA):",
    "narrator_intro_ar": "عن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Anas (RA):",
    "translation_en": "O Allah, I seek refuge in You from male and female evil spirits.",
    "translation_ar": "اللهم إني أعوذ بك من الخبث والخبائث.",
    "translation_id": "Ya Allah, aku berlindung kepada-Mu dari setan laki-laki dan setan perempuan."
  },
  {
    "id": 21,
    "category": "Kundalik",
    "title": "Xojatxonadan chiqishda",
    "narrator_intro": "Oisha (r.a)dan:",
    "arabic": "غُفْرَانَكَ",
    "transcription": "G'ufroonaka",
    "translation": "(Allohim!) Sening mag'firatingni so'rayman.",
    "reference": "Termiziy",
    "title_en": "Leaving the Toilet",
    "title_ar": "دعاء الخروج من الخلاء",
    "title_id": "Doa Keluar Kamar Mandi",
    "narrator_intro_en": "Narrated by Aisha (RA):",
    "narrator_intro_ar": "عن عائشة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Aisyah (RA):",
    "translation_en": "I seek Your forgiveness.",
    "translation_ar": "غفرانك.",
    "translation_id": "Aku memohon ampun-Mu."
  },
  {
    "id": 22,
    "category": "Kundalik",
    "title": "Ovqatlanishdan oldin",
    "narrator_intro": "Oyisha (r.a)dan:",
    "arabic": "بِسْمِ اللهِ",
    "transcription": "Bismillaah",
    "translation": "Allohning ismi bilan.",
    "reference": "Abu Dovud",
    "title_en": "Before Eating",
    "title_ar": "قبل الطعام",
    "title_id": "Sebelum Makan",
    "narrator_intro_en": "Narrated by Aisha (RA):",
    "narrator_intro_ar": "عن عائشة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Aisyah (RA):",
    "translation_en": "In the Name of Allah.",
    "translation_ar": "بسم الله.",
    "translation_id": "Dengan nama Allah."
  },
  {
    "id": 23,
    "category": "Kundalik",
    "title": "Ovqatdan so'ng",
    "narrator_intro": "Abu Sa'iyd al-Xudriy(r.a)dan:",
    "arabic": "الْحَمْدُ للهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
    "transcription": "Al-hamdu lillaahil-lazii at'amanaa va saqoonaa va ja'alanaa muslimiin",
    "translation": "Bizni yedirgan, ichirgan va musulmonlar qatorida qilgan Allohga hamd bo'lsin.",
    "reference": "Abu Dovud, Termiziy",
    "title_en": "After Eating",
    "title_ar": "بعد الطعام",
    "title_id": "Setelah Makan",
    "narrator_intro_en": "Narrated by Abu Said al-Khudri (RA):",
    "narrator_intro_ar": "عن أبي سعيد الخدري رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Said al-Khudri (RA):",
    "translation_en": "All praise is due to Allah who fed us, gave us drink, and made us Muslims.",
    "translation_ar": "الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين.",
    "translation_id": "Segala puji bagi Allah yang telah memberi kami makan, minum, dan menjadikan kami muslim."
  },
  {
    "id": 24,
    "category": "Kundalik",
    "title": "Uydan chiqishda",
    "narrator_intro": "Anas (r.a)dan:",
    "arabic": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
    "transcription": "Bismillaahi, tavakkaltu 'alalloohi, va laa xovla va laa quvvata illaa billaah",
    "translation": "Allohning ismi bilan. Allohga tavakkal qildim. Kuch va quvvat faqat Allohdandir.",
    "reference": "Termiziy",
    "title_en": "Leaving the House",
    "title_ar": "دعاء الخروج من المنزل",
    "title_id": "Doa Keluar Rumah",
    "narrator_intro_en": "Narrated by Anas (RA):",
    "narrator_intro_ar": "عن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Anas (RA):",
    "translation_en": "In the Name of Allah. I place my trust in Allah. There is no power nor might except with Allah.",
    "translation_ar": "بسم الله توكلت على الله ولا حول ولا قوة إلا بالله.",
    "translation_id": "Dengan nama Allah, aku bertawakkal kepada Allah. Tiada daya dan kekuatan kecuali milik Allah."
  },
  {
    "id": 25,
    "category": "Kundalik",
    "title": "Uyga kirishda",
    "narrator_intro": "Abu Molik al-Ash'ariy(r.a)dan:",
    "arabic": "بِسْمِ اللهِ وَلَجْنَا، وَبِسْمِ اللهِ خَرَجْنَا، وَعَلَى اللهِ رَبِّنَا تَوَكَّلْنَا",
    "transcription": "Bismillaahi valajnaa, va bismillaahi xorojnaa, va 'alalloohi robbinaa tavakkalnaa",
    "translation": "Alloh nomi bilan kirdik, Alloh nomi bilan chiqdik. Robbimiz Allohga tavakkal qildik.",
    "reference": "Abu Dovud",
    "title_en": "Entering the House",
    "title_ar": "دعاء دخول المنزل",
    "title_id": "Doa Masuk Rumah",
    "narrator_intro_en": "Narrated by Abu Malik al-Ashari (RA):",
    "narrator_intro_ar": "عن أبي مالك الأشعري رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Malik al-Asyari (RA):",
    "translation_en": "In the Name of Allah we enter, in the Name of Allah we leave, and upon Allah our Lord we place our trust.",
    "translation_ar": "بسم الله ولجنا وبسم الله خرجنا وعلى الله ربنا توكلنا.",
    "translation_id": "Dengan nama Allah kami masuk, dengan nama Allah kami keluar, dan kepada Allah Tuhan kami, kami bertawakkal."
  },
  {
    "id": 26,
    "category": "Kundalik",
    "title": "Kiyim kiyganda",
    "narrator_intro": "Muoz ibn Anas(r.a)dan:",
    "arabic": "الْحَمْدُ للهِ الَّذِي كَسَانِي هَذَا، وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
    "transcription": "Al-hamdu lillaahil-lazii kasaanii haazaa, va rozaqoniihi min g'oyri havlim-minnii va laa quvvah",
    "translation": "O'zimdan hech qanday mashaqqat-u quvvatsiz bu libosni kiydirgan, meni u bilan rizqlantirgan Allohga hamdlar bo'lsin.",
    "reference": "Abu Dovud",
    "title_en": "When Wearing Clothes",
    "title_ar": "دعاء لبس الثوب",
    "title_id": "Doa Memakai Pakaian",
    "narrator_intro_en": "Narrated by Muadh ibn Anas (RA):",
    "narrator_intro_ar": "عن معاذ بن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Muadz bin Anas (RA):",
    "translation_en": "All praise is due to Allah who clothed me with this and provided it for me without any power or might from me.",
    "translation_ar": "الحمد لله الذي كساني هذا ورزقنيه من غير حول مني ولا قوة.",
    "translation_id": "Segala puji bagi Allah yang telah memberiku pakaian ini dan memberikan rezeki tanpa daya dan kekuatan dariku."
  },
  {
    "id": 27,
    "category": "Kundalik",
    "title": "Bozorga kirishda",
    "narrator_intro": "Umar(r.a)dan:",
    "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "transcription": "Laa ilaaha illalloohu vahdahuu laa shariika lah. Lahul-mulku va lahul-hamdu, yuhyii va yumiitu, va huva hayyun la yamuut. Biyadihil xoyru... ",
    "translation": "Yagona, sheriksiz Allohdan o'zga haq ma'bud yo'q... Ulug'lik Uni qamragan, kibriyo Uning libosidir.",
    "reference": "Termiziy",
    "title_en": "Entering the Market",
    "title_ar": "دعاء دخول السوق",
    "title_id": "Doa Masuk Pasar",
    "narrator_intro_en": "Narrated by Umar (RA):",
    "narrator_intro_ar": "عن عمر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Umar (RA):",
    "translation_en": "There is no god but Allah alone, without partner. His is the dominion and praise. He gives life and causes death. He is the Ever-Living who never dies. In His hand is all goodness, and He has power over all things.",
    "translation_ar": "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير.",
    "translation_id": "Tiada tuhan selain Allah semata, tiada sekutu bagi-Nya. Milik-Nya kerajaan dan segala pujian. Dia menghidupkan dan mematikan. Dia Mahahidup yang tidak mati. Di tangan-Nya segala kebaikan, dan Dia Mahakuasa atas segala sesuatu."
  },
  {
    "id": 28,
    "category": "Kundalik",
    "title": "Aksirganda aytiladigan",
    "narrator_intro": "Abu Hurayra (r.a)dan:",
    "arabic": "الْحَمْدُ للهِ",
    "transcription": "Alhamdu lillaah",
    "translation": "Allohga maqtovlar bo'lsin (Eshitgan: Yarhamukalloh, qabul qilgan: Yahdiykumullohu va yuslihu baalakum deydi).",
    "reference": "Buxoriy",
    "title_en": "When Sneezing",
    "title_ar": "عند العطاس",
    "title_id": "Ketika Bersin",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "All praise is due to Allah. (The listener says: May Allah have mercy on you. The sneezer replies: May Allah guide you and improve your condition.)",
    "translation_ar": "الحمد لله. (الجواب: يرحمك الله. ثم الرد: يهديكم الله ويصلح بالكم.)",
    "translation_id": "Segala puji bagi Allah. (Yang mendengar: Semoga Allah merahmatimu. Yang bersin menjawab: Semoga Allah memberimu petunjuk dan memperbaiki keadaanmu.)"
  },
  {
    "id": 29,
    "category": "Safar",
    "title": "Safarga otlanganda (Ulovga)",
    "narrator_intro": "Oyati karima (Zuxruf: 13-14):",
    "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ. وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "transcription": "Subhaanallazii soxxoro lanaa haazaa va maa kunnaa lahuu muqriniin. Va innaa ilaa robbinaa lamunqolibuun",
    "translation": "Bizga buni (ulovni) bo'ysundirib bergan zot pokdir. Biz aslida bunga kuchimiz yetmas edi. Ва, albatta, biz robbimizga qaytuvchilarmiz.",
    "reference": "Qur'oni Karim",
    "title_en": "Beginning a Journey (Riding a Vehicle)",
    "title_ar": "دعاء ركوب الدابة",
    "title_id": "Doa Naik Kendaraan",
    "narrator_intro_en": "Quranic verse (Az-Zukhruf: 13-14):",
    "narrator_intro_ar": "آية كريمة (الزخرف: 13-14):",
    "narrator_intro_id": "Ayat Al-Quran (Az-Zukhruf: 13-14):",
    "translation_en": "Glory be to Him who has subjected this to us, for we could never have accomplished it ourselves. And to our Lord we shall surely return.",
    "translation_ar": "سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون.",
    "translation_id": "Mahasuci Dzat yang telah menundukkan ini untuk kami, padahal kami tidak mampu menguasainya. Dan sesungguhnya kepada Tuhan kami, kami pasti kembali."
  },
  {
    "id": 30,
    "category": "Safar",
    "title": "Safar duosining davomi",
    "narrator_intro": "Ibn Umar (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى",
    "transcription": "Alloohumma innaa nas'aluka fiy safarinaa haazal birro vat taqvo, va minal 'amali maa tarzo",
    "translation": "Allohim, biz ushbu safarimizda Sendan yaxshilik va taqvoni, O'zing rozi bo'ladigan amallarni so'raymiz.",
    "reference": "Muslim",
    "title_en": "Continuation of Travel Dua",
    "title_ar": "تتمة دعاء السفر",
    "title_id": "Lanjutan Doa Safar",
    "narrator_intro_en": "Narrated by Ibn Umar (RA):",
    "narrator_intro_ar": "عن ابن عمر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Umar (RA):",
    "translation_en": "O Allah, we ask You in this journey of ours for righteousness, piety, and deeds that please You.",
    "translation_ar": "اللهم إنا نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى.",
    "translation_id": "Ya Allah, kami memohon kepada-Mu dalam perjalanan ini kebaikan, ketakwaan, dan amal yang Engkau ridhai."
  },
  {
    "id": 31,
    "category": "Safar",
    "title": "Manzilga tushganda (yetib borganda)",
    "narrator_intro": "Xavla binti Hakiym(r.a)dan:",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "transcription": "A'uuzu bikalimaatillaahit taammaati min sharri maa xolaq",
    "translation": "Men Allohning mukammal kalimalari orqali U yaratgan narsalar yovuzligidan panoh tilayman.",
    "reference": "Muslim",
    "title_en": "Arriving at a Destination",
    "title_ar": "دعاء نزول المنزل",
    "title_id": "Doa Tiba di Tempat Tujuan",
    "narrator_intro_en": "Narrated by Khawlah bint Hakim (RA):",
    "narrator_intro_ar": "عن خولة بنت حكيم رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Khaulah binti Hakim (RA):",
    "translation_en": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
    "translation_ar": "أعوذ بكلمات الله التامات من شر ما خلق.",
    "translation_id": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari keburukan apa yang Dia ciptakan."
  },
  {
    "id": 32,
    "category": "Safar",
    "title": "Safardan qishlog'iga qaytganda",
    "narrator_intro": "Anas (r.a)dan:",
    "arabic": "آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ",
    "transcription": "Aayibuuna taa'ibuuna 'aabiduuna lirobbinaa haamiduun",
    "translation": "Biz omon-eson qaytuvchilarmiz, tavba qiluvchilarmiz, Robbimizga ibodat qiluvchi va hamd aytuvchilarmiz.",
    "reference": "Muslim",
    "title_en": "Returning from a Journey",
    "title_ar": "دعاء العودة من السفر",
    "title_id": "Doa Pulang dari Perjalanan",
    "narrator_intro_en": "Narrated by Anas (RA):",
    "narrator_intro_ar": "عن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Anas (RA):",
    "translation_en": "We are returning, repenting, worshipping, and praising our Lord.",
    "translation_ar": "آيبون تائبون عابدون لربنا حامدون.",
    "translation_id": "Kami kembali, bertaubat, beribadah, dan memuji Tuhan kami."
  },
  {
    "id": 33,
    "category": "Oila",
    "title": "Farzandlar himoyasi",
    "narrator_intro": "Ibn Abbos (r.a)dan:",
    "arabic": "أُعِيذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
    "transcription": "Ui'izukumaa bi kalimaatillaahit-taammah, min kulli shaytooniv-va haammah, va min kulli 'aynil-laammah",
    "translation": "Men ikkingizni (farzandni) Allohning komil kalimalari bilan har qanday shaytondan, zararkunanda hasharotdan va har qanday yomon ko'zdan panohiga topshiraman. (Hasan va Husaynga aytilgan)",
    "reference": "Buxoriy",
    "title_en": "Protection of Children",
    "title_ar": "تعويذ الأولاد",
    "title_id": "Perlindungan Anak",
    "narrator_intro_en": "Narrated by Ibn Abbas (RA):",
    "narrator_intro_ar": "عن ابن عباس رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Abbas (RA):",
    "translation_en": "I seek protection for you both in the perfect words of Allah from every devil, every poisonous creature, and every evil eye.",
    "translation_ar": "أعيذكما بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة.",
    "translation_id": "Aku melindungi kalian berdua dengan kalimat-kalimat Allah yang sempurna dari setiap setan, makhluk berbisa, dan setiap mata yang dengki."
  },
  {
    "id": 34,
    "category": "Oila",
    "title": "Homila va qiyofani so'rash",
    "narrator_intro": "Zahariyya (a.s) duosi (Oli Imron: 38):",
    "arabic": "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
    "transcription": "Robbi hab lii milladunka zurriyyatan toyyiba, innaka samiy'ud du'aa",
    "translation": "Robbim, menga O'z dargohingdan pokiza zurriyot ato et! Albatta, Sen duoni eshituvchisan.",
    "reference": "Qur'oni Karim",
    "title_en": "Dua for Righteous Offspring",
    "title_ar": "دعاء طلب الذرية الصالحة",
    "title_id": "Doa Memohon Keturunan Shaleh",
    "narrator_intro_en": "Dua of Zakariyya (AS) - Ali Imran: 38:",
    "narrator_intro_ar": "دعاء زكريا عليه السلام (آل عمران: 38):",
    "narrator_intro_id": "Doa Zakariya (AS) - Ali Imran: 38:",
    "translation_en": "My Lord, grant me from Yourself good offspring. Indeed, You are the Hearer of supplication.",
    "translation_ar": "رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء.",
    "translation_id": "Ya Tuhanku, karuniakanlah kepadaku dari sisi-Mu keturunan yang baik. Sesungguhnya Engkau Maha Mendengar doa."
  },
  {
    "id": 35,
    "category": "Oila",
    "title": "Ota-ona haqqiga duo",
    "narrator_intro": "Isro surasi, 24-oyat:",
    "arabic": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
    "transcription": "Robbi-rhamhumaa kamaa robbayaanii sog'iiroo",
    "translation": "Robbim! Ular (ota-onam) meni kichikligimda mehr bilan tarbiya qilganlaridek, ularga Sen ham rahm qilgin.",
    "reference": "Qur'oni Karim",
    "title_en": "Dua for Parents",
    "title_ar": "دعاء للوالدين",
    "title_id": "Doa untuk Orang Tua",
    "narrator_intro_en": "Surah Al-Isra, verse 24:",
    "narrator_intro_ar": "سورة الإسراء، آية 24:",
    "narrator_intro_id": "Surah Al-Isra, ayat 24:",
    "translation_en": "My Lord, have mercy upon them as they brought me up when I was small.",
    "translation_ar": "رب ارحمهما كما ربياني صغيراً.",
    "translation_id": "Ya Tuhanku, sayangilah keduanya sebagaimana mereka telah mendidikku ketika kecil."
  },
  {
    "id": 36,
    "category": "Bemorlik",
    "title": "Kasalni ko'rgani borganda",
    "narrator_intro": "Ibn Abbos (r.a)dan:",
    "arabic": "لَا بَأْسَ، طَهُورٌ إِنْ شَاءَ اللهُ",
    "transcription": "Laa ba'sa, Tohuurun in shaa Allooh",
    "translation": "Hech qisi yo'q (xavotir olmang), Alloh xohlasa, gunohlaringizni poklovchidir.",
    "reference": "Buxoriy",
    "title_en": "Visiting the Sick",
    "title_ar": "عيادة المريض",
    "title_id": "Menjenguk Orang Sakit",
    "narrator_intro_en": "Narrated by Ibn Abbas (RA):",
    "narrator_intro_ar": "عن ابن عباس رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Abbas (RA):",
    "translation_en": "No harm, it is a purification, if Allah wills.",
    "translation_ar": "لا بأس طهور إن شاء الله.",
    "translation_id": "Tidak apa-apa, ini adalah penyucian, insya Allah."
  },
  {
    "id": 37,
    "category": "Bemorlik",
    "title": "Shifo so'rash (7 marta o'qilagani)",
    "narrator_intro": "Ibn Abbos (r.a)dan:",
    "arabic": "أَسْأَلُ اللهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ",
    "transcription": "As'alulloohal-'aziima robbal-'arshil-'aziimi ay yashfiyak",
    "translation": "Men Buyuk Arshning Robbi bo'lgan Ulug' Allohdan senga shifo berishini so'rayman.",
    "reference": "Abu Dovud va Termiziy",
    "title_en": "Asking for Healing (7 times)",
    "title_ar": "طلب الشفاء (7 مرات)",
    "title_id": "Memohon Kesembuhan (7 kali)",
    "narrator_intro_en": "Narrated by Ibn Abbas (RA):",
    "narrator_intro_ar": "عن ابن عباس رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Abbas (RA):",
    "translation_en": "I ask Allah the Almighty, the Lord of the Mighty Throne, to cure you.",
    "translation_ar": "أسأل الله العظيم رب العرش العظيم أن يشفيك.",
    "translation_id": "Aku memohon kepada Allah Yang Mahaagung, Tuhan Arasy yang agung, untuk menyembuhkanmu."
  },
  {
    "id": 38,
    "category": "Bemorlik",
    "title": "Tanasidagi og'riq paytida",
    "narrator_intro": "Usmon ibn Abul-Os (r.a)dan:",
    "arabic": "بِسْمِ اللهِ (3)، أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ (7)",
    "transcription": "Bismillaah (3 marta), a'uzu billaahi va qudrotihii min sharri maa ajidu va uhaazir (7 marta)",
    "translation": "Allohning nomi bilan (uch marta). Men o'zimda sezayotgan va xavotirlanayotgan narsaning yomonligidan Allohga va Uning qudratiga panoh tilayman (yetti marta qo'lni qo'yib).",
    "reference": "Muslim",
    "title_en": "When in Pain",
    "title_ar": "عند الألم",
    "title_id": "Ketika Merasa Sakit",
    "narrator_intro_en": "Narrated by Uthman ibn Abul-As (RA):",
    "narrator_intro_ar": "عن عثمان بن أبي العاص رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Utsman bin Abul-Ash (RA):",
    "translation_en": "In the Name of Allah (3 times). I seek refuge in Allah and His power from the evil of what I find and what I fear (7 times).",
    "translation_ar": "بسم الله (3 مرات)، أعوذ بالله وقدرته من شر ما أجد وأحاذر (7 مرات).",
    "translation_id": "Dengan nama Allah (3 kali). Aku berlindung kepada Allah dan kekuasaan-Nya dari keburukan apa yang aku rasakan dan aku takutkan (7 kali)."
  },
  {
    "id": 39,
    "category": "Bemorlik",
    "title": "Bemor kishining duosi",
    "narrator_intro": "Oyisha (r.a)dan:",
    "arabic": "اللَّهُمَّ رَبَّ النَّاسِ مُذْهِبَ الْبَاسِ اِشْفِ أَنْتَ الشَّافِي، لَا شَافِيَ إِلَّا أَنْتَ شِفَاءً لَا يُغَادِرُ سَقَمًا",
    "transcription": "Alloohumma robban-naasi, muzhibal-ba'si, ishihi anta ash-shaafiy, laa shaafiya illaa ant, shifaa'an laa yug'aadiru saqomaa",
    "translation": "Robbim! Insonlar egasi, mashaqqatlarni ketkazuvchi Zot! Unga shifo bergin, Sen shifo beruvchisan, Sendan boshqa shifo berguvchi yo'q. Qoldirmaydigan bir shifo bergin.",
    "reference": "Buxoriy va Muslim",
    "title_en": "Dua of the Sick Person",
    "title_ar": "دعاء المريض",
    "title_id": "Doa Orang Sakit",
    "narrator_intro_en": "Narrated by Aisha (RA):",
    "narrator_intro_ar": "عن عائشة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Aisyah (RA):",
    "translation_en": "O Allah, Lord of mankind, remover of hardship, grant healing. You are the Healer, there is no healing except Your healing, a healing that leaves no sickness.",
    "translation_ar": "اللهم رب الناس مذهب البأس اشف أنت الشافي لا شافي إلا أنت شفاء لا يغادر سقماً.",
    "translation_id": "Ya Allah, Tuhan manusia, penghilang penderitaan, sembuhkanlah. Engkau Maha Menyembuhkan, tiada kesembuhan kecuali kesembuhan-Mu, kesembuhan yang tidak menyisakan penyakit."
  },
  {
    "id": 40,
    "category": "Qabr",
    "title": "Musibat yetganda",
    "narrator_intro": "Ummu Salama (r.a)dan:",
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
    "transcription": "Innaa lillaahi va innaa ilayhi rooji'uun, Alloohumma'jurnii fiy musiybatii va axliflii xoyrom-minhaa",
    "translation": "Biz, albatta, Allohnikimiz va shubhasiz faqat Unga qaytuvchimiz. Allohim, musibatimda menga savob ato qil va uning o'rniga undan ham yaxshirog'ini o'rinbosar qilgin.",
    "reference": "Muslim",
    "title_en": "When Calamity Strikes",
    "title_ar": "عند المصيبة",
    "title_id": "Ketika Tertimpa Musibah",
    "narrator_intro_en": "Narrated by Umm Salamah (RA):",
    "narrator_intro_ar": "عن أم سلمة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Ummu Salamah (RA):",
    "translation_en": "Indeed to Allah we belong and to Him we shall return. O Allah, reward me in my affliction and replace it with something better.",
    "translation_ar": "إنا لله وإنا إليه راجعون. اللهم أجرني في مصيبتي وأخلف لي خيراً منها.",
    "translation_id": "Sesungguhnya kami milik Allah dan kepada-Nya kami kembali. Ya Allah, berilah aku pahala dalam musibahku dan gantikanlah dengan yang lebih baik."
  },
  {
    "id": 41,
    "category": "Qabr",
    "title": "Qabristonga kirganda salom",
    "narrator_intro": "Burayda (r.a)dan:",
    "arabic": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ",
    "transcription": "As-salaamu 'alaykum ahlad-diyaari minal-mu'miniina val-muslimiin. Va innaa in-shaa-alloohu bikum laahiquuna",
    "translation": "Sizlarga salom bo'lsin, ey mo'min va musulmonlar yashaydigan diyor ahli! Alloh xohlasa, biz ham tez orada sizga qo'shilamiz. Allohdan o'zimizga ham, sizlarga ham xotirjamlik tilaymiz.",
    "reference": "Muslim",
    "title_en": "Greeting at the Cemetery",
    "title_ar": "السلام على أهل القبور",
    "title_id": "Salam Ziarah Kubur",
    "narrator_intro_en": "Narrated by Buraydah (RA):",
    "narrator_intro_ar": "عن بريدة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Buraidah (RA):",
    "translation_en": "Peace be upon you, O inhabitants of this abode among the believers and Muslims. Allah willing, we shall join you. We ask Allah for well-being for us and for you.",
    "translation_ar": "السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله بكم لاحقون.",
    "translation_id": "Semoga keselamatan atas kalian, wahai penghuni kubur dari kaum mukminin dan muslimin. Insya Allah kami akan menyusul kalian."
  },
  {
    "id": 42,
    "category": "Qabr",
    "title": "Janoza namozi duosi",
    "narrator_intro": "Abu Hurayra (r.a)dan:",
    "arabic": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا",
    "transcription": "Alloohummag'fir lihayyinaa va mayyitinaa, va shaahidinaa va g'ooibinaa, va sog'iirinaa va kabiirinaa, va zakarinaa va unsaanaa.",
    "translation": "Ey Allohim! Oramizdagi tiriklar va o'liklarni, shu yerda bo'lganlar-u yo'qlarni, kichik bezorilaru kattalarni, erkag-u ayolimizni mag'firat qilgin.",
    "reference": "Termiziy",
    "title_en": "Janazah (Funeral) Prayer Dua",
    "title_ar": "دعاء صلاة الجنازة",
    "title_id": "Doa Shalat Jenazah",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "O Allah, forgive our living and our dead, those present and absent, our young and old, our males and females.",
    "translation_ar": "اللهم اغفر لحينا وميتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذكرنا وأنثانا.",
    "translation_id": "Ya Allah, ampunilah orang yang hidup dan yang mati di antara kami, yang hadir dan yang tidak hadir, yang kecil dan yang besar, yang laki-laki dan yang perempuan."
  },
  {
    "id": 43,
    "category": "Haj",
    "title": "Talbiya (Haromga kirganda)",
    "narrator_intro": "Ibn Umar (r.a)dan:",
    "arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ",
    "transcription": "Labbaykalloohumma labbayk! Labbayka laa shariika laka labbayk. Innal hamda van-ni'mata laka val-mulk, laa shariika lak.",
    "translation": "Men Sen tomonga yuzlanganman, ey Alloh, men Sen tomonga yuzlanganman! Sening sheriging yo'q... Albatta barcha hamd, ne'mat va mulk faqat Sengagina xos. Sening sheriging yo'q!",
    "reference": "Buxoriy va Muslim",
    "title_en": "Talbiyah (Entering Ihram)",
    "title_ar": "التلبية",
    "title_id": "Talbiyah",
    "narrator_intro_en": "Narrated by Ibn Umar (RA):",
    "narrator_intro_ar": "عن ابن عمر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Umar (RA):",
    "translation_en": "Here I am, O Allah, here I am! Here I am, You have no partner, here I am! All praise, grace, and dominion belong to You. You have no partner.",
    "translation_ar": "لبيك اللهم لبيك، لبيك لا شريك لك لبيك. إن الحمد والنعمة لك والملك لا شريك لك.",
    "translation_id": "Aku memenuhi panggilan-Mu ya Allah. Tiada sekutu bagi-Mu. Segala puji, nikmat, dan kerajaan milik-Mu, tiada sekutu bagi-Mu."
  },
  {
    "id": 44,
    "category": "Haj",
    "title": "Safo va Marva orasida",
    "narrator_intro": "Jobir (r.a)dan:",
    "arabic": "لَا إِلَهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "transcription": "Laa ilaaha illallohu vahdahuu laa shariyka lah. Lahul-mulku va lahul hamdu va huva 'ala kulli shay'in qodiyr.",
    "translation": "Yagona Allohdan o'zga haq ma'bud yo'q. Mulk ham Uniki, barcha hamd ham Unikidir. U barcha narsaga Qodirdir. Alloh O'z va'dasining ustidan chiqdi, ishini g'olib qildi...",
    "reference": "Muslim",
    "title_en": "Between Safa and Marwah",
    "title_ar": "بين الصفا والمروة",
    "title_id": "Antara Shafa dan Marwah",
    "narrator_intro_en": "Narrated by Jabir (RA):",
    "narrator_intro_ar": "عن جابر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Jabir (RA):",
    "translation_en": "There is no god but Allah alone, without partner. His is the dominion and praise, and He has power over all things.",
    "translation_ar": "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.",
    "translation_id": "Tiada tuhan selain Allah semata, tiada sekutu bagi-Nya. Milik-Nya kerajaan dan pujian, serta Dia Mahakuasa atas segala sesuatu."
  },
  {
    "id": 45,
    "category": "Haj",
    "title": "Arafot kunidning zikri",
    "narrator_intro": "Amr ibn Shuaybning otasidan:",
    "arabic": "لَا إِلَهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "transcription": "Laa ilaaha illallohu vahdahuu laa shariika lah... (aynan yuqoriga o'xshaydi)",
    "translation": "Payg'ambarlar umuman Arafot kunida aytgan eng yaxshi duo.",
    "reference": "Termiziy",
    "title_en": "Day of Arafat Dhikr",
    "title_ar": "ذكر يوم عرفة",
    "title_id": "Dzikir Hari Arafah",
    "narrator_intro_en": "From Amr ibn Shuayb, from his father:",
    "narrator_intro_ar": "عن عمرو بن شعيب عن أبيه:",
    "narrator_intro_id": "Dari Amr bin Syuaib dari ayahnya:",
    "translation_en": "The best supplication the prophets have collectively said on the Day of Arafat.",
    "translation_ar": "أفضل ما دعا به النبيون يوم عرفة.",
    "translation_id": "Doa terbaik yang diucapkan para nabi pada hari Arafah."
  },
  {
    "id": 46,
    "category": "Ramazon",
    "title": "Iftorlik vaqtidagi duo",
    "narrator_intro": "Ibn Umar (r.a)dan:",
    "arabic": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللهُ",
    "transcription": "Zahabaz zoma'u vabtallatil 'uruuqu va sabatal ajru in shaa Alloh",
    "translation": "Chanqoq ketdi, tomirlar namlandi va inshaalloh ajr-savob sobit bo'ldi.",
    "reference": "Abu Dovud",
    "title_en": "Iftar (Breaking Fast) Dua",
    "title_ar": "دعاء الإفطار",
    "title_id": "Doa Berbuka Puasa",
    "narrator_intro_en": "Narrated by Ibn Umar (RA):",
    "narrator_intro_ar": "عن ابن عمر رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Umar (RA):",
    "translation_en": "The thirst has gone, the veins are moist, and the reward is certain, if Allah wills.",
    "translation_ar": "ذهب الظمأ وابتلت العروق وثبت الأجر إن شاء الله.",
    "translation_id": "Telah hilang dahaga, urat-urat telah basah, dan pahala telah ditetapkan, insya Allah."
  },
  {
    "id": 47,
    "category": "Ramazon",
    "title": "Laylatul Qadrda so'raladigan duo",
    "narrator_intro": "Oyisha (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
    "transcription": "Alloohumma innaka 'afuvvun tuhibbul 'afva fa'fu 'annii",
    "translation": "Ey Allohim! Sen, shubhasiz, afv etuvchisan (kechirimli), afv etib kechirishni yaxshi ko'rasan, shunday ekan, meni afv etgil!",
    "reference": "Ibn Moja, Termiziy",
    "title_en": "Laylat al-Qadr Dua",
    "title_ar": "دعاء ليلة القدر",
    "title_id": "Doa Lailatul Qadr",
    "narrator_intro_en": "Narrated by Aisha (RA):",
    "narrator_intro_ar": "عن عائشة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Aisyah (RA):",
    "translation_en": "O Allah, You are the One who pardons greatly and You love to pardon, so pardon me.",
    "translation_ar": "اللهم إنك عفو تحب العفو فاعف عني.",
    "translation_id": "Ya Allah, sesungguhnya Engkau Maha Pemaaf, Engkau menyukai maaf, maka maafkanlah aku."
  },
  {
    "id": 48,
    "category": "Salovat",
    "title": "1. Buxoriydagi to'liq salovat",
    "narrator_intro": "Abdulloh ibn Zayd (r.a)dan:",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
    "transcription": "Alloohumma solli 'alaa muhammadiv va 'alaa aali muhammad. Kamaa sollayta 'alaa ibroohiima va aa'la aali ibroohiim. Innaka hamiidun majiid.",
    "translation": "Ey Allohim! Muhammad (alayhissalom)ga va u zotning axli oilasiga salovat (va rahmat) yuborgin, huddi Ibrohim alayhissalomga va ularning oilasiga salovat yuborganing kabi. Shubhasiz, Sen hamdga loyiqsan, buyuk Zotsan.",
    "reference": "Buxoriy",
    "title_en": "1. Full Salawat from Bukhari",
    "title_ar": "1. الصلاة الإبراهيمية الكاملة",
    "title_id": "1. Shalawat Lengkap dari Bukhari",
    "narrator_intro_en": "Narrated by Abdullah ibn Zayd (RA):",
    "narrator_intro_ar": "عن عبد الله بن زيد رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abdullah bin Zaid (RA):",
    "translation_en": "O Allah, send blessings upon Muhammad and his family, as You sent blessings upon Ibrahim and his family. You are Praiseworthy, Most Glorious.",
    "translation_ar": "اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad dan keluarganya, sebagaimana atas Ibrahim dan keluarganya. Engkau Maha Terpuji lagi Maha Mulia."
  },
  {
    "id": 49,
    "category": "Salovat",
    "title": "2. Baraka so'ralgan salovat",
    "narrator_intro": "Abu Ubayda (r.a)dan:",
    "arabic": "اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
    "transcription": "Alloohumma baarik 'alaa muhammadiv va 'alaa aali muhammad. Kamaa baarokta 'alaa ibroohiima va aa'la aali ibroohiim. Innaka hamiidun majiid.",
    "translation": "Allohim! Muhammad (a.s)ga va uning axli oilasiga xuddi Ibrohim va uning oilasiga barakot bergandek barakot bergin. Shubhasiz Sen hamdga loyiq, buyukdirsan.",
    "reference": "Buxoriy",
    "title_en": "2. Salawat for Blessings",
    "title_ar": "2. صلاة البركة",
    "title_id": "2. Shalawat Keberkahan",
    "narrator_intro_en": "Narrated by Abu Ubaydah (RA):",
    "narrator_intro_ar": "عن أبي عبيدة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Ubaidah (RA):",
    "translation_en": "O Allah, bless Muhammad and his family as You blessed Ibrahim and his family. You are Praiseworthy, Most Glorious.",
    "translation_ar": "اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد.",
    "translation_id": "Ya Allah, berkahilah Muhammad dan keluarganya, sebagaimana Engkau berkahi Ibrahim dan keluarganya."
  },
  {
    "id": 50,
    "category": "Salovat",
    "title": "3. Qisqa salovat (kunlik uchun)",
    "narrator_intro": "Muslim ummatida umuman yozuv va nutqda ko'p ishlatiladigan eng qisqa salovat.",
    "arabic": "صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ",
    "transcription": "Sollalloohu 'alayhi va sallam",
    "translation": "Alloh unga (payg'ambar Muhammad s.a.v ga) salovat (va rahmot) hamda salom yog'dirsin!",
    "reference": "",
    "title_en": "3. Short Daily Salawat",
    "title_ar": "3. أقصر صلاة يومية",
    "title_id": "3. Shalawat Singkat Harian",
    "narrator_intro_en": "The most commonly used short salawat.",
    "narrator_intro_ar": "أكثر الصلوات استعمالاً.",
    "narrator_intro_id": "Shalawat singkat yang paling sering digunakan.",
    "translation_en": "May the blessings and peace of Allah be upon him.",
    "translation_ar": "صلى الله عليه وسلم.",
    "translation_id": "Semoga shalawat dan salam Allah tercurah atasnya."
  },
  {
    "id": 51,
    "category": "Salovat",
    "title": "4. Rasululloh oilalari uchun",
    "narrator_intro": "Abu Humayd (r.a)dan:",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ",
    "transcription": "Alloohumma solli 'alaa muhammadiv va azvaajihii va zurriyyatihii kama sollayta 'alaa aali Ibroohiim...",
    "translation": "Ey Allohim! Muhammad alayhissalomga, ularning qavjlari (xotinlari)ga va zurriyotlariga salovat yubor... Huddi Ibrohim alayhissalom xonadoniga salovat yuborganidek.",
    "reference": "Buxoriy, Muslim",
    "title_en": "4. For the Prophet's Family",
    "title_ar": "4. الصلاة على آل النبي",
    "title_id": "4. Shalawat untuk Keluarga Nabi",
    "narrator_intro_en": "Narrated by Abu Humayd (RA):",
    "narrator_intro_ar": "عن أبي حميد رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Humaid (RA):",
    "translation_en": "O Allah, send blessings upon Muhammad, his wives, and descendants, as You sent blessings upon the family of Ibrahim.",
    "translation_ar": "اللهم صل على محمد وأزواجه وذريته كما صليت على آل إبراهيم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, istri-istri dan keturunannya, sebagaimana atas keluarga Ibrahim."
  },
  {
    "id": 52,
    "category": "Salovat",
    "title": "5. Eng oson qisqa salovat",
    "narrator_intro": "Qisqa ma'noli eng oson yodlanuvchi.",
    "arabic": "اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ",
    "transcription": "Alloohumma solli 'alaa muhammadiv va 'alaa aali muhammad",
    "translation": "Ey Allohim! O'zing janobi Muhammad (s.a.v)ga va u zotni axli shajara (yoki avlodlari)ga salovotu rahmatingni yubor.",
    "reference": "Tabaroniy",
    "title_en": "5. Easiest Short Salawat",
    "title_ar": "5. أسهل صلاة قصيرة",
    "title_id": "5. Shalawat Singkat Termudah",
    "narrator_intro_en": "Short and easy to memorize.",
    "narrator_intro_ar": "قصيرة وسهلة الحفظ.",
    "narrator_intro_id": "Singkat dan mudah dihafal.",
    "translation_en": "O Allah, send blessings upon Muhammad and his family.",
    "translation_ar": "اللهم صل على محمد وعلى آل محمد.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad dan keluarganya."
  },
  {
    "id": 53,
    "category": "Salovat",
    "title": "6. Sayyidil Anbiyo",
    "narrator_intro": "Sunnatga yaqin bo'lgan mashhur juma salovati:",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadinin-nabiyyil-ummiyyi va 'alaa aalihii va sohbihii va sallim",
    "translation": "Allohim, sayyidimiz, xat-savod o'rganmagan (ummiy) nabiy bo'lgan Muhammadga, uning oilasi hamda sahobalariga ham chinakam rahmat va salomlar yubor!",
    "reference": "Mashhur",
    "title_en": "6. Sayyid al-Anbiya",
    "title_ar": "6. الصلاة على سيد الأنبياء",
    "title_id": "6. Shalawat Sayyidul Anbiya",
    "narrator_intro_en": "A well-known Friday salawat:",
    "narrator_intro_ar": "صلاة مشهورة تُقال يوم الجمعة:",
    "narrator_intro_id": "Shalawat Jumat terkenal:",
    "translation_en": "O Allah, send blessings upon our master Muhammad, the unlettered Prophet, his family and companions.",
    "translation_ar": "اللهم صل على سيدنا محمد النبي الأمي وعلى آله وصحبه وسلم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas junjungan kami Muhammad, Nabi ummi, keluarga dan sahabatnya."
  },
  {
    "id": 54,
    "category": "Salovat",
    "title": "7. Salovati Munjiya (Najot)",
    "narrator_intro": "Balo va ofatlardan najot topish uchun tavsiya qilingan duo.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُنْجِينَا بِهَا مِنْ جَمِيعِ الْأَهْوَالِ وَالْآفَاتِ... وَتَقْضِي لَنَا بِهَا جَمِيعَ الْحَاجَاتِ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadin solaatan tunjiinaa bihaa min jami'il-ahvaali val-aafaat... va taqdii lanaa bihaa jami'al-haajaat",
    "translation": "Allohim! Sayyidimiz Muhammadga shunday salovat yo'llaginki, u sababli bizni barcha qo'rquv va ofatlardan qutqargin, barcha hojatlarimizni ravo qilgin.",
    "reference": "Tariqat ulamolari",
    "title_en": "7. Salawat al-Munjiyah",
    "title_ar": "7. الصلاة المنجية",
    "title_id": "7. Shalawat Munjiyah",
    "narrator_intro_en": "For protection from trials.",
    "narrator_intro_ar": "للنجاة من البلاء.",
    "narrator_intro_id": "Untuk perlindungan dari cobaan.",
    "translation_en": "O Allah, send blessings upon Muhammad, by which You save us from all fears and fulfill our needs.",
    "translation_ar": "اللهم صل على سيدنا محمد صلاة تنجينا بها من جميع الأهوال والآفات وتقضي لنا بها جميع الحاجات.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad yang dengannya Engkau selamatkan kami dari segala ketakutan dan kabulkan kebutuhan kami."
  },
  {
    "id": 55,
    "category": "Salovat",
    "title": "8. Salovati Nariya (Tafrijiyya) qisqasi",
    "narrator_intro": "Qiyinchilikdan yechilish uchun mashhur xalq salovoti.",
    "arabic": "اللَّهُمَّ صَلِّ صَلَاةً كَامِلَةً وَسَلِّمْ سَلَامًا تَامًّا عَلَى سَيِّدِنَا مُحَمَّدٍ الَّذِي تَنْحَلُّ بِهِ الْعُقَدُ",
    "transcription": "Alloohumma solli solaatan kaamilatan va sallim salaaman taamman 'alaa sayyidinaa muhammadin... tanhallu bihil-u'qodu",
    "translation": "Ey Alloh! Sayyidimiz Muhammad (s.a.v) ga to'liq salovat yuborgin va komil salom yo'llagin! U Zot hurmati tufayli tugunlar yechilur va musibat-g'amlar ketur...",
    "reference": "",
    "title_en": "8. Short Salawat Nariyah",
    "title_ar": "8. الصلاة النارية المختصرة",
    "title_id": "8. Shalawat Nariyah Singkat",
    "narrator_intro_en": "Popular for relief from difficulties.",
    "narrator_intro_ar": "مشهورة لتفريج الكرب.",
    "narrator_intro_id": "Terkenal untuk melepas kesulitan.",
    "translation_en": "O Allah, send perfect blessings and peace upon our master Muhammad, by whom knots are untied.",
    "translation_ar": "اللهم صل صلاة كاملة وسلم سلاماً تاماً على سيدنا محمد الذي تنحل به العقد.",
    "translation_id": "Ya Allah, limpahkanlah shalawat sempurna dan salam sempurna atas junjungan kami Muhammad, yang dengannya terurai segala ikatan."
  },
  {
    "id": 56,
    "category": "Salovat",
    "title": "9. Salovati Tibbiya",
    "narrator_intro": "Bemorlik va kasbiy ruhiy og'riqlar shifosi uchun.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ طِبِّ الْقُلُوبِ وَدَوَائِهَا وَعَافِيَةِ الْأَبْدَانِ وَشِفَائِهَا",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadin tibbil quluubi va davaa'ihaa va 'aafiyatil abdaani va shifaa'ihaa",
    "translation": "Allohim! Sayyidimiz Muhammadga salovat yuborgin, u zot qalblarning tabibi va da’vosidir, jasadlarning ofiyati va shifosidir, ko'zlarning nuri va ziyosidir.",
    "reference": "Ahlullohlar tavsiyasi",
    "title_en": "9. Salawat Tibbiyah",
    "title_ar": "9. الصلاة الطبية",
    "title_id": "9. Shalawat Thibbiyah",
    "narrator_intro_en": "For healing of ailments.",
    "narrator_intro_ar": "لشفاء الجسد والروح.",
    "narrator_intro_id": "Untuk penyembuhan penyakit.",
    "translation_en": "O Allah, send blessings upon Muhammad, the medicine of hearts, the well-being of bodies and their healing.",
    "translation_ar": "اللهم صل على سيدنا محمد طب القلوب ودوائها وعافية الأبدان وشفائها.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, obat hati dan penawarnya, keselamatan badan dan penyembuhannya."
  },
  {
    "id": 57,
    "category": "Salovat",
    "title": "10. Salovati Fatih",
    "narrator_intro": "Rizq eshiklari va baraka ochilishi uchun tavsiya qilinadi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ الْفَاتِحِ لِمَا أُغْلِقَ وَالْخَاتِمِ لِمَا سَبَقَ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadinil faatihi limaa ug'liqo val xootimi limaa sabaqo",
    "translation": "Allohim! Berkik narsalarni ochuvchi, yopiq narsalarga xotima yasovchi bo'lgan sayyidimiz Muhammadga salovat yuborgin.",
    "reference": "",
    "title_en": "10. Salawat al-Fatih",
    "title_ar": "10. الصلاة الفاتح",
    "title_id": "10. Shalawat Fatih",
    "narrator_intro_en": "For opening doors of sustenance.",
    "narrator_intro_ar": "لفتح أبواب الرزق.",
    "narrator_intro_id": "Untuk membuka pintu rezeki.",
    "translation_en": "O Allah, send blessings upon Muhammad, the opener of what is closed and the seal of what preceded.",
    "translation_ar": "اللهم صل على سيدنا محمد الفاتح لما أُغلق والخاتم لما سبق.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, pembuka yang tertutup dan penutup yang telah lalu."
  },
  {
    "id": 58,
    "category": "Salovat",
    "title": "11. Salovati Ummiya",
    "narrator_intro": "Ayniqsa Asr namozidan keyin aytilishi sunnatga muvofiq.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِهِ وَسَلِّمْ",
    "transcription": "Alloohumma solli 'alaa muhammadinin-nabiyyil ummiyyi va 'alaa aalihii va sallim",
    "translation": "Allohim, ummiy Nabiy bo'lmish Muhammadga va u zotning axli oilalariga salovat va salom yo'llagin.",
    "reference": "Abu Dovud",
    "title_en": "11. Salawat Ummiyyah",
    "title_ar": "11. الصلاة على النبي الأمي",
    "title_id": "11. Shalawat Nabi Ummi",
    "narrator_intro_en": "Recommended after Asr prayer.",
    "narrator_intro_ar": "يُستحب بعد صلاة العصر.",
    "narrator_intro_id": "Dianjurkan setelah shalat Ashar.",
    "translation_en": "O Allah, send blessings upon Muhammad, the unlettered Prophet, his family, and peace.",
    "translation_ar": "اللهم صل على محمد النبي الأمي وعلى آله وسلم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, Nabi ummi, keluarganya, dan salam."
  },
  {
    "id": 59,
    "category": "Salovat",
    "title": "12. Salovati G'avsiya",
    "narrator_intro": "Osmonu yerning yaraligicha uzun va katta salovat.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadiv va 'alaa aali sayyidinaa muhammadin maa daamatis-samaavaatu val-arz",
    "translation": "Allohim, garchi osmonlar va yer barkamol chiqar ekan, Sen sayyidimiz Muhammadga va u zotning oilasiga shuncha ko'p salovat yubor.",
    "reference": "",
    "title_en": "12. Salawat Ghawthiyyah",
    "title_ar": "12. الصلاة الغوثية",
    "title_id": "12. Shalawat Ghutsiyyah",
    "narrator_intro_en": "Eternal salawat.",
    "narrator_intro_ar": "صلاة ما دامت السماوات والأرض.",
    "narrator_intro_id": "Shalawat selama langit dan bumi ada.",
    "translation_en": "O Allah, send blessings upon Muhammad and his family as long as the heavens and earth endure.",
    "translation_ar": "اللهم صل على سيدنا محمد وعلى آل سيدنا محمد ما دامت السماوات والأرض.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad dan keluarganya selama langit dan bumi masih ada."
  },
  {
    "id": 60,
    "category": "Salovat",
    "title": "13. Roziylik salovati",
    "narrator_intro": "Ruveyfi' ibn Sobit (r.a)dan:",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَنْزِلْهُ الْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ يَوْمَ الْقِيَامَةِ",
    "transcription": "Alloohumma solli 'alaa muhammadiv va anzilhul maq'adal muqorroba 'indaka yavmal qiyaamah",
    "translation": "Allohim! Muhammadga salovat yo'lla hamda uni Qiyomat kunida O'z huzuringdagi eng yaqin, muqarrab o'ringa joylashtir.",
    "reference": "Imom Ahmad",
    "title_en": "13. Salawat of Contentment",
    "title_ar": "13. صلاة الرضا",
    "title_id": "13. Shalawat Keridhaan",
    "narrator_intro_en": "Narrated by Ruwayfi ibn Thabit (RA):",
    "narrator_intro_ar": "عن رويفع بن ثابت رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ruwayfi bin Tsabit (RA):",
    "translation_en": "O Allah, send blessings upon Muhammad and seat him in the nearest station to You on Judgment Day.",
    "translation_ar": "اللهم صل على محمد وأنزله المقعد المقرب عندك يوم القيامة.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad dan tempatkan beliau di kedudukan terdekat di sisi-Mu pada hari kiamat."
  },
  {
    "id": 61,
    "category": "Salovat",
    "title": "14. Juma salovati (80 marta)",
    "narrator_intro": "Juma kuni Asrdan keyin 80 marta aytilsa 80 yillik gunoh kechiriladi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ النَّبِيِّ الْأُمِّيِّ",
    "transcription": "Alloohumma solli 'alaa muhammadin 'abidika va rosuulikan-nabiyyil ummiyy",
    "translation": "Allohim! O'zingning quling va elching bo'lgan ummiy Nabiy Muhammadga salovat yubor.",
    "reference": "Tabaroniy",
    "title_en": "14. Friday Salawat (80 times)",
    "title_ar": "14. صلاة الجمعة (80 مرة)",
    "title_id": "14. Shalawat Jumat (80 kali)",
    "narrator_intro_en": "80 times after Asr on Friday expiates 80 years of sins.",
    "narrator_intro_ar": "80 مرة بعد العصر يوم الجمعة تغفر ذنوب 80 سنة.",
    "narrator_intro_id": "80 kali setelah Ashar pada Jumat menghapus dosa 80 tahun.",
    "translation_en": "O Allah, send blessings upon Muhammad, Your servant and messenger, the unlettered Prophet.",
    "translation_ar": "اللهم صل على محمد عبدك ورسولك النبي الأمي.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, hamba dan utusan-Mu, Nabi ummi."
  },
  {
    "id": 62,
    "category": "Salovat",
    "title": "15. Farishtalar aytadigan salovat",
    "narrator_intro": "Arsh va osmonlarning maxfiy zikri hisoblanadi.",
    "arabic": "صَلَّى اللهُ عَلَى النَّبِيِّ الْأُمِّيِّ",
    "transcription": "Sollalloohu 'alan nabiyyil ummiyy",
    "translation": "Alloh o'quv va yozuvni o'rganmagan (ummiy) Nabiyga salovat yubordi.",
    "reference": "",
    "title_en": "15. Angelic Salawat",
    "title_ar": "15. صلاة الملائكة",
    "title_id": "15. Shalawat Malaikat",
    "narrator_intro_en": "A hidden dhikr of the Throne.",
    "narrator_intro_ar": "ذكر خفي للعرش.",
    "narrator_intro_id": "Dzikir tersembunyi dari Arsy.",
    "translation_en": "May the blessings of Allah be upon the unlettered Prophet.",
    "translation_ar": "صلى الله على النبي الأمي.",
    "translation_id": "Semoga shalawat Allah tercurah atas Nabi yang ummi."
  },
  {
    "id": 63,
    "category": "Salovat",
    "title": "16. Shifoi Qulub",
    "narrator_intro": "Qalbda Rosulullohga xursandchilik va muhabbat paydo qiladi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ حَبِيبِ الرَّحْمَنِ، وَسَيِّدِ الْأَكْوَانِ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadin habiybir-rohmaan, va sayyidil akvaan",
    "translation": "Allohim! Rahmonning sevimlisi bo'lgan, butun borliqning sayyidi Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "16. Heart Healing Salawat",
    "title_ar": "16. شفاء القلوب",
    "title_id": "16. Shalawat Penyembuh Hati",
    "narrator_intro_en": "Generates joy and love for the Prophet.",
    "narrator_intro_ar": "تُولّد الفرح والمحبة لرسول الله.",
    "narrator_intro_id": "Melahirkan kegembiraan dan cinta kepada Rasulullah.",
    "translation_en": "O Allah, send blessings upon Muhammad, the beloved of the Most Merciful and master of all creation.",
    "translation_ar": "اللهم صل على سيدنا محمد حبيب الرحمن وسيد الأكوان.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, kekasih Ar-Rahman dan penghulu seluruh alam."
  },
  {
    "id": 64,
    "category": "Salovat",
    "title": "17. Salovati A'zam",
    "narrator_intro": "Barcha payg'ambarlarga salom yo'llanadigan duo.",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِكَ أَنْ تُصَلِّيَ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى سَائِرِ الْأَنْبِيَاءِ وَالْمُرْسَلِينَ",
    "transcription": "Alloohumma innii as'aluka bika an tusolliya 'alaa sayyidinaa muhammadin, va 'alaa saa'iril anbiyaa'i val mursaliyn",
    "translation": "Allohim! O'zingning haqqing hurmati sayyidimiz Muhammadga hamda boshqa barcha nabiylar va rusullarga salovat yo'llashingni so'rayman.",
    "reference": "",
    "title_en": "17. Supreme Salawat",
    "title_ar": "17. الصلاة العظمى",
    "title_id": "17. Shalawat Agung",
    "narrator_intro_en": "Sending blessings upon all prophets.",
    "narrator_intro_ar": "إرسال الصلوات على جميع الأنبياء.",
    "narrator_intro_id": "Mengirim shalawat kepada semua nabi.",
    "translation_en": "O Allah, I ask You to send blessings upon Muhammad and all the other prophets and messengers.",
    "translation_ar": "اللهم إني أسألك بك أن تصلي على سيدنا محمد وعلى سائر الأنبياء والمرسلين.",
    "translation_id": "Ya Allah, aku memohon agar Engkau limpahkan shalawat atas Muhammad dan seluruh para nabi dan rasul."
  },
  {
    "id": 65,
    "category": "Salovat",
    "title": "18. Salovati Nuur",
    "narrator_intro": "Sirli ilmlarga oshno bo'lish va ko'z ravshanligi uchun.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى نُورِ الْأَنْوَارِ وَسِرِّ الْأَسْرَارِ وَتِرْيَاقِ الْأَغْيَارِ",
    "transcription": "Alloohumma solli 'alaa nuuril anvaari va sirril asroori va tiryaaqil ag'yaar",
    "translation": "Allohim! Nurlar nuri, sirlar siri va g'ayri shubhalarning davosi bo'lmish Zotga (Muhammadni nazarda tutadi) salovat yo'lla!",
    "reference": "",
    "title_en": "18. Salawat of Light",
    "title_ar": "18. صلاة النور",
    "title_id": "18. Shalawat Nur",
    "narrator_intro_en": "For enlightenment and insight.",
    "narrator_intro_ar": "لنور البصيرة.",
    "narrator_intro_id": "Untuk pencerahan spiritual.",
    "translation_en": "O Allah, send blessings upon the Light of lights, the Secret of secrets.",
    "translation_ar": "اللهم صل على نور الأنوار وسر الأسرار وترياق الأغيار.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Cahaya segala cahaya, Rahasia segala rahasia."
  },
  {
    "id": 66,
    "category": "Salovat",
    "title": "19. Behisob salovat",
    "narrator_intro": "Barcha aytilgan va aytilmagan maxluqotlar ismichi qo'shib aytishning eng oson yo'li.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ بِعَدَدِ مَنْ صَلَّى عَلَيْهِ، وَصَلِّ عَلَى مُحَمَّدٍ بِعَدَدِ مَنْ لَمْ يُصَلِّ عَلَيْهِ",
    "transcription": "Alloohumma solli 'alaa muhammadim bi'adadi man sollaa 'alayhi, va solli 'alaa muhammadim bi'adadi mallam yusolli 'alayh",
    "translation": "Allohim! Muhammadga unga salovat aytganlar adadicha salovat yo'lla. Hamda unga salovat aytmaganlar adadicha ham salovat yo'lla.",
    "reference": "",
    "title_en": "19. Countless Salawat",
    "title_ar": "19. الصلاة بلا حصر",
    "title_id": "19. Shalawat Tanpa Batas",
    "narrator_intro_en": "The easiest way to include all in salawat.",
    "narrator_intro_ar": "أسهل طريقة لشمل الجميع.",
    "narrator_intro_id": "Cara termudah mencakup semua dalam shalawat.",
    "translation_en": "O Allah, send blessings upon Muhammad to the number of those who sent blessings, and those who did not.",
    "translation_ar": "اللهم صل على محمد بعدد من صلى عليه وصل على محمد بعدد من لم يصل عليه.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad sebanyak yang bershalawat dan sebanyak yang tidak."
  },
  {
    "id": 67,
    "category": "Salovat",
    "title": "20. Shoma'il salovati",
    "narrator_intro": "Eng oddiy, hammabop, ko'chada yurib ham aytiladigan zikr.",
    "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ",
    "transcription": "Alloohumma solli va sallim va baarik 'alayh",
    "translation": "Allohim unga (Payg'ambarimiz s.a.v.ga) ko'plab salovat, salom va barakot yo'llagin.",
    "reference": "",
    "title_en": "20. Shamail Salawat",
    "title_ar": "20. صلاة الشمائل",
    "title_id": "20. Shalawat Syamail",
    "narrator_intro_en": "Simple, can be said anytime.",
    "narrator_intro_ar": "بسيطة يمكن أن تُقال في أي وقت.",
    "narrator_intro_id": "Sederhana, bisa dibaca kapan saja.",
    "translation_en": "O Allah, send blessings, peace, and barakah upon him.",
    "translation_ar": "اللهم صل وسلم وبارك عليه.",
    "translation_id": "Ya Allah, limpahkanlah shalawat, salam, dan berkah atasnya."
  },
  {
    "id": 68,
    "category": "Salovat",
    "title": "21. Salovati Ka'b",
    "narrator_intro": "Ka'b ibn Ujra (r.a)dan rivoyat qilingan qisqa shakl.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ",
    "transcription": "Alloohumma solli 'alaa muhammadin kamaa sollayta 'alaa aali ibroohiim, Alloohumma baarik 'alaa muhammadin kamaa baarokta 'alaa aali ibroohiim",
    "translation": "Allohim! Muhammadga huddi Ibrohim oilasiga salovat yo'llaganingdek salovat yo'lla. Allohim! Muhammadga huddi Ibrohim oilasiga baraka berganingdek baraka bergin.",
    "reference": "Nasaiy",
    "title_en": "21. Ka'b Salawat",
    "title_ar": "21. صلاة كعب",
    "title_id": "21. Shalawat Ka'b",
    "narrator_intro_en": "Narrated by Ka'b ibn Ujrah (RA):",
    "narrator_intro_ar": "عن كعب بن عجرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ka'b bin Ujrah (RA):",
    "translation_en": "O Allah, send blessings upon Muhammad as You sent upon Ibrahim. O Allah, bless Muhammad as You blessed Ibrahim.",
    "translation_ar": "اللهم صل على محمد كما صليت على آل إبراهيم، اللهم بارك على محمد كما باركت على آل إبراهيم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad sebagaimana atas keluarga Ibrahim, dan berkahilah Muhammad sebagaimana Engkau berkahi keluarga Ibrahim."
  },
  {
    "id": 69,
    "category": "Salovat",
    "title": "22. Rizq va Baraka salovati",
    "narrator_intro": "Ulamolar tomonidan rizq kengligi uchun tavsiya etiladi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُوَسِّعُ بِهَا عَلَيْنَا الْأَرْزَاقَ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadin solaatan tuvassi'u bihaa 'alaynal arzooq",
    "translation": "Allohim! Sayyidimiz Muhammadga shunday salovat yo'llaginki, u sababli bizga rizqlarni keng qilib bergin.",
    "reference": "",
    "title_en": "22. Sustenance Salawat",
    "title_ar": "22. صلاة الرزق والبركة",
    "title_id": "22. Shalawat Rezeki",
    "narrator_intro_en": "Recommended by scholars for expanding sustenance.",
    "narrator_intro_ar": "يوصي بها العلماء لسعة الرزق.",
    "narrator_intro_id": "Dianjurkan ulama untuk keluasan rezeki.",
    "translation_en": "O Allah, send blessings upon Muhammad, by which You expand our sustenance.",
    "translation_ar": "اللهم صل على سيدنا محمد صلاة توسع بها علينا الأرزاق.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad yang dengannya Engkau luaskan rezeki kami."
  },
  {
    "id": 70,
    "category": "Salovat",
    "title": "23. Doimiy salovat",
    "narrator_intro": "Har vaqt aytilishi mumkin bo'lgan go'zal zikr.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ فِي الْأَوَّلِينَ، وَصَلِّ عَلَى مُحَمَّدٍ فِي الْآخِرِينَ",
    "transcription": "Alloohumma solli 'alaa muhammadin fil avvaliin, va solli 'alaa muhammadin fil aaxiriin",
    "translation": "Allohim! Avvalgilar ichida ham Muhammadga salovat yo'lla, oxirgilar ichida ham Muhammadga salovat yo'lla.",
    "reference": "Tabaroniy",
    "title_en": "23. Eternal Salawat",
    "title_ar": "23. الصلاة الدائمة",
    "title_id": "23. Shalawat Abadi",
    "narrator_intro_en": "Can be said at all times.",
    "narrator_intro_ar": "يمكن أن تُقال في كل وقت.",
    "narrator_intro_id": "Bisa dibaca kapan saja.",
    "translation_en": "O Allah, send blessings upon Muhammad among the first and among the last.",
    "translation_ar": "اللهم صل على محمد في الأولين وصل على محمد في الآخرين.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad di antara yang pertama dan yang terakhir."
  },
  {
    "id": 71,
    "category": "Salovat",
    "title": "24. Nurli salovat",
    "narrator_intro": "Qalblar nuri uchun aytiladigan zikr.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ نُورِ الْقُلُوبِ وَرَوْحِ الْأَرْوَاحِ",
    "transcription": "Alloohumma solli 'alaa muhammadin nuuril quluubi va rov-hil arvooh",
    "translation": "Allohim! Qalblar nuri va ruhlar oromi bo'lmish Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "24. Luminous Salawat",
    "title_ar": "24. الصلاة النورانية",
    "title_id": "24. Shalawat Bercahaya",
    "narrator_intro_en": "For the light of hearts.",
    "narrator_intro_ar": "لنور القلوب.",
    "narrator_intro_id": "Untuk cahaya hati.",
    "translation_en": "O Allah, send blessings upon Muhammad, the light of hearts and the spirit of souls.",
    "translation_ar": "اللهم صل على محمد نور القلوب وروح الأرواح.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, cahaya hati dan roh segala roh."
  },
  {
    "id": 72,
    "category": "Salovat",
    "title": "25. Shafaat salovati",
    "narrator_intro": "Qiyomatda shafaut umidida aytiladi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَنْزِلْهُ الْمَنْزِلَ الْمُقَرَّبَ عِنْدَكَ يَوْمَ الْقِيَامَةِ",
    "transcription": "Alloohumma solli 'alaa muhammadiv va anzilhul manzilal muqorroba 'indaka yavmal qiyaamah",
    "translation": "Allohim! Muhammadga salovat yo'lla va uni Qiyomat kuni O'z huzuringdagi yaqin manzilga joylashtir.",
    "reference": "Imom Ahmad",
    "title_en": "25. Intercession Salawat",
    "title_ar": "25. صلاة الشفاعة",
    "title_id": "25. Shalawat Syafaat",
    "narrator_intro_en": "In hope of intercession on Judgment Day.",
    "narrator_intro_ar": "رجاءً في الشفاعة يوم القيامة.",
    "narrator_intro_id": "Berharap syafaat di hari kiamat.",
    "translation_en": "O Allah, send blessings upon Muhammad and seat him in the nearest station to You on Judgment Day.",
    "translation_ar": "اللهم صل على محمد وأنزله المنزل المقرب عندك يوم القيامة.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad dan tempatkan beliau di kedudukan terdekat pada hari kiamat."
  },
  {
    "id": 73,
    "category": "Salovat",
    "title": "26. Olamlar rahmatiga salovat",
    "narrator_intro": "Payg'ambarimiz (s.a.v)ning sifatlari bilan duo.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مَنْ أَرْسَلْتَهُ رَحْمَةً لِلْعَالَمِينَ",
    "transcription": "Alloohumma solli 'alaa man arsaltahu rohmatal lil'aalamiin",
    "translation": "Allohim! Sen olamlarga rahmat qilib yuborgan zotingga salovat yo'lla.",
    "reference": "",
    "title_en": "26. Mercy to the Worlds",
    "title_ar": "26. رحمة للعالمين",
    "title_id": "26. Rahmat bagi Alam Semesta",
    "narrator_intro_en": "With the attributes of the Prophet (PBUH).",
    "narrator_intro_ar": "بصفات النبي ﷺ.",
    "narrator_intro_id": "Dengan sifat-sifat Nabi SAW.",
    "translation_en": "O Allah, send blessings upon the one You sent as a mercy to all worlds.",
    "translation_ar": "اللهم صل على من أرسلته رحمة للعالمين.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas yang Engkau utus sebagai rahmat bagi seluruh alam."
  },
  {
    "id": 74,
    "category": "Salovat",
    "title": "27. Mushfiq salovat",
    "narrator_intro": "Mehribon payg'ambarimizga salom.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى النَّبِيِّ الرَّؤُوفِ الرَّحِيمِ",
    "transcription": "Alloohumma solli 'alan nabiyyir rauufir rohiim",
    "translation": "Allohim! O'ta mehribon va rahmli bo'lgan Payg'ambarga salovat yo'lla.",
    "reference": "",
    "title_en": "27. Compassionate Salawat",
    "title_ar": "27. الصلاة المشفقة",
    "title_id": "27. Shalawat Penuh Kasih",
    "narrator_intro_en": "A greeting to our merciful Prophet.",
    "narrator_intro_ar": "سلام على نبينا الرحيم.",
    "narrator_intro_id": "Salam kepada Nabi yang penyayang.",
    "translation_en": "O Allah, send blessings upon the compassionate, merciful Prophet.",
    "translation_ar": "اللهم صل على النبي الرؤوف الرحيم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Nabi yang penuh kasih dan penyayang."
  },
  {
    "id": 75,
    "category": "Salovat",
    "title": "28. Bashorat salovati",
    "narrator_intro": "Yaxshi xabarlar umidida aytiladi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ بَشِيرِ الْخَيْرِ",
    "transcription": "Alloohumma solli 'alaa muhammadin bashiiril xoyr",
    "translation": "Allohim! Yaxshilik bashorat beruvchisi bo'lgan Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "28. Glad Tidings Salawat",
    "title_ar": "28. صلاة البشارة",
    "title_id": "28. Shalawat Kabar Gembira",
    "narrator_intro_en": "In hope of good news.",
    "narrator_intro_ar": "رجاءً في الخير.",
    "narrator_intro_id": "Berharap kabar baik.",
    "translation_en": "O Allah, send blessings upon Muhammad, the bearer of glad tidings.",
    "translation_ar": "اللهم صل على محمد بشير الخير.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, pembawa kabar gembira."
  },
  {
    "id": 76,
    "category": "Salovat",
    "title": "29. Kamolot salovati",
    "narrator_intro": "Insoniy komillik timsoliga salovat.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مَنْ خَلَقْتَهُ لِيَكُونَ نُورًا",
    "transcription": "Alloohumma solli 'alaa man xolaqtahu liyakuuna nuuroo",
    "translation": "Allohim! Sen nur bo'lishi uchun yaratgan zotingga salovat yo'lla.",
    "reference": "",
    "title_en": "29. Perfection Salawat",
    "title_ar": "29. صلاة الكمال",
    "title_id": "29. Shalawat Kesempurnaan",
    "narrator_intro_en": "For the symbol of human perfection.",
    "narrator_intro_ar": "لتمثال الكمال الإنساني.",
    "narrator_intro_id": "Untuk simbol kesempurnaan manusia.",
    "translation_en": "O Allah, send blessings upon the one You created to be a light.",
    "translation_ar": "اللهم صل على من خلقته ليكون نوراً.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas yang Engkau ciptakan untuk menjadi cahaya."
  },
  {
    "id": 77,
    "category": "Salovat",
    "title": "30. Izat salovati",
    "narrator_intro": "Aziz Payg'ambarimizga ehtirom.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ الْعَزِيزِ الْمُكَرَّمِ",
    "transcription": "Alloohumma solli 'alaa muhammadinil 'aziizil mukarrom",
    "translation": "Allohim! Aziz va mukarram bo'lgan Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "30. Honor Salawat",
    "title_ar": "30. صلاة العزة",
    "title_id": "30. Shalawat Kemuliaan",
    "narrator_intro_en": "Respect for our noble Prophet.",
    "narrator_intro_ar": "إجلال لنبينا الكريم.",
    "narrator_intro_id": "Penghormatan untuk Nabi yang mulia.",
    "translation_en": "O Allah, send blessings upon Muhammad, the honored and noble.",
    "translation_ar": "اللهم صل على محمد العزيز المكرم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, yang mulia dan terhormat."
  },
  {
    "id": 78,
    "category": "Salovat",
    "title": "31. Hidoyat salovati",
    "narrator_intro": "To'g'ri yo'l boshlovchisiga salom.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى الْهَادِي إِلَى صِرَاطِكَ الْمُسْتَقِيمِ",
    "transcription": "Alloohumma solli 'alal haadiy ilaa sirootikal mustaqiim",
    "translation": "Allohim! Sening to'g'ri yo'lingga boshlovchi zotga salovat yo'lla.",
    "reference": "",
    "title_en": "31. Guidance Salawat",
    "title_ar": "31. صلاة الهداية",
    "title_id": "31. Shalawat Hidayah",
    "narrator_intro_en": "For the guide to the right path.",
    "narrator_intro_ar": "للهادي إلى الصراط المستقيم.",
    "narrator_intro_id": "Untuk pembimbing ke jalan yang benar.",
    "translation_en": "O Allah, send blessings upon the guide to Your straight path.",
    "translation_ar": "اللهم صل على الهادي إلى صراطك المستقيم.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas pembimbing ke jalan-Mu yang lurus."
  },
  {
    "id": 79,
    "category": "Salovat",
    "title": "32. Haqiqat salovati",
    "narrator_intro": "Haqiqiy yo'lni ko'rsatuvchiga salovat.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى صَاحِبِ الْحَقِّ وَالْحَقِيقَةِ",
    "transcription": "Alloohumma solli 'alaa soohibil haqqi val haqiyqoh",
    "translation": "Allohim! Haq va haqiqat sohibiga salovat yo'lla.",
    "reference": "",
    "title_en": "32. Truth Salawat",
    "title_ar": "32. صلاة الحقيقة",
    "title_id": "32. Shalawat Kebenaran",
    "narrator_intro_en": "For the one who shows the true path.",
    "narrator_intro_ar": "لمن يُرشد إلى الحق.",
    "narrator_intro_id": "Untuk yang menunjukkan jalan kebenaran.",
    "translation_en": "O Allah, send blessings upon the possessor of truth and reality.",
    "translation_ar": "اللهم صل على صاحب الحق والحقيقة.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas pemilik kebenaran dan hakikat."
  },
  {
    "id": 80,
    "category": "Salovat",
    "title": "33. Poklik salovati",
    "narrator_intro": "Eng pokiza zotga salom.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى الطَّاهِرِ الْمُطَهَّرِ",
    "transcription": "Alloohumma solli 'alat too-hiril mutoh-har",
    "translation": "Allohim! Pok va poklangan zotga salovat yo'lla.",
    "reference": "",
    "title_en": "33. Purity Salawat",
    "title_ar": "33. صلاة الطهارة",
    "title_id": "33. Shalawat Kesucian",
    "narrator_intro_en": "For the purest being.",
    "narrator_intro_ar": "لأطهر الخلق.",
    "narrator_intro_id": "Untuk makhluk tersuci.",
    "translation_en": "O Allah, send blessings upon the pure and purified one.",
    "translation_ar": "اللهم صل على الطاهر المطهر.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas yang suci dan disucikan."
  },
  {
    "id": 81,
    "category": "Salovat",
    "title": "34. Shifoatbaxsh salovat",
    "narrator_intro": "Dardlarga davo bo'lishi niyatida.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ شِفَاءِ كُلِّ دَاءٍ",
    "transcription": "Alloohumma solli 'alaa muhammadin shifaa'i kulli daa'",
    "translation": "Allohim! Har bir dardning shifosi bo'lgan Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "34. Healing Salawat",
    "title_ar": "34. صلاة الشفاء",
    "title_id": "34. Shalawat Penyembuhan",
    "narrator_intro_en": "With the intention of healing.",
    "narrator_intro_ar": "بنية الشفاء من الأدواء.",
    "narrator_intro_id": "Dengan niat penyembuhan.",
    "translation_en": "O Allah, send blessings upon Muhammad, the cure for every ailment.",
    "translation_ar": "اللهم صل على محمد شفاء كل داء.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, penyembuh setiap penyakit."
  },
  {
    "id": 82,
    "category": "Salovat",
    "title": "35. Barakotli salovat",
    "narrator_intro": "Hayotda baraka so'rab aytiladi.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ بَحْرِ الْأَنْوَارِ وَمَعْدِنِ الْأَسْرَارِ",
    "transcription": "Alloohumma solli 'alaa muhammadin bahril anvaari va ma'dinil asroor",
    "translation": "Allohim! Nurlar dengizi va sirlar koni bo'lgan Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "35. Blessed Salawat",
    "title_ar": "35. الصلاة المباركة",
    "title_id": "35. Shalawat Penuh Berkah",
    "narrator_intro_en": "For blessings in life.",
    "narrator_intro_ar": "لبركة الحياة.",
    "narrator_intro_id": "Untuk berkah dalam kehidupan.",
    "translation_en": "O Allah, send blessings upon Muhammad, the ocean of lights and mine of secrets.",
    "translation_ar": "اللهم صل على محمد بحر الأنوار ومعدن الأسرار.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, lautan cahaya dan tambang rahasia."
  },
  {
    "id": 83,
    "category": "Salovat",
    "title": "36. G'alaba salovati",
    "narrator_intro": "Nusrat va muvaffaqiyat umidida.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مَنْ أَيَّدْتَهُ بِالنَّصْرِ",
    "transcription": "Alloohumma solli 'alaa man ayyadtahu bin nasri",
    "translation": "Allohim! Sen nusrat (g'alaba) bilan qo'llagan zotingga salovat yo'lla.",
    "reference": "",
    "title_en": "36. Victory Salawat",
    "title_ar": "36. صلاة النصر",
    "title_id": "36. Shalawat Kemenangan",
    "narrator_intro_en": "In hope of victory and success.",
    "narrator_intro_ar": "رجاءً في النصر والتوفيق.",
    "narrator_intro_id": "Berharap kemenangan dan keberhasilan.",
    "translation_en": "O Allah, send blessings upon the one You supported with victory.",
    "translation_ar": "اللهم صل على من أيدته بالنصر.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas yang Engkau dukung dengan kemenangan."
  },
  {
    "id": 84,
    "category": "Salovat",
    "title": "37. Jibriyl salovati",
    "narrator_intro": "Farishtalar sayyidi tilidan.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ كَمَا تُحِبُّ وَتَرْضَى",
    "transcription": "Alloohumma solli 'alaa muhammadin kamaa tuhibbu va tarzoo",
    "translation": "Allohim! O'zing yaxshi ko'radigan va rozi bo'ladigan shaklda Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "37. Jibril Salawat",
    "title_ar": "37. صلاة جبريل",
    "title_id": "37. Shalawat Jibril",
    "narrator_intro_en": "In the tongue of the chief of angels.",
    "narrator_intro_ar": "بلسان سيد الملائكة.",
    "narrator_intro_id": "Dalam lisan pemimpin malaikat.",
    "translation_en": "O Allah, send blessings upon Muhammad as You love and are pleased with.",
    "translation_ar": "اللهم صل على محمد كما تحب وترضى.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad sebagaimana Engkau cintai dan ridhai."
  },
  {
    "id": 85,
    "category": "Salovat",
    "title": "38. Qalb oromi salovati",
    "narrator_intro": "Sokinlik topish uchun.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ قُرَّةِ أَعْيُنِنَا",
    "transcription": "Alloohumma solli 'alaa muhammadin qurroti a'yuninaa",
    "translation": "Allohim! Ko'zlarimiz quvonchi bo'lgan Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "38. Tranquility Salawat",
    "title_ar": "38. صلاة السكينة",
    "title_id": "38. Shalawat Ketenangan",
    "narrator_intro_en": "For finding peace.",
    "narrator_intro_ar": "لإيجاد السكينة.",
    "narrator_intro_id": "Untuk menemukan ketenangan.",
    "translation_en": "O Allah, send blessings upon Muhammad, the delight of our eyes.",
    "translation_ar": "اللهم صل على محمد قرة أعيننا.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, penyejuk mata kami."
  },
  {
    "id": 86,
    "category": "Salovat",
    "title": "39. Rahmoniy salovat",
    "narrator_intro": "Mehribon Robbdan rahm-shafqat umidida.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ مَنْبَعِ الرَّحْمَةِ",
    "transcription": "Alloohumma solli 'alaa muhammadin manba'ir rohmah",
    "translation": "Allohim! Rahmat manbai bo'lgan Muhammadga salovat yo'lla.",
    "reference": "",
    "title_en": "39. Merciful Salawat",
    "title_ar": "39. صلاة الرحمة",
    "title_id": "39. Shalawat Rahmat",
    "narrator_intro_en": "In hope of mercy from the Lord.",
    "narrator_intro_ar": "رجاءً في رحمة الرب.",
    "narrator_intro_id": "Berharap rahmat dari Tuhan.",
    "translation_en": "O Allah, send blessings upon Muhammad, the source of mercy.",
    "translation_ar": "اللهم صل على محمد منبع الرحمة.",
    "translation_id": "Ya Allah, limpahkanlah shalawat atas Muhammad, sumber rahmat."
  },
  {
    "id": 87,
    "category": "Salovat",
    "title": "40. Abadiy salovat",
    "narrator_intro": "To qiyomatgacha davom etuvchi duolar.",
    "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةً دَائِمَةً بِدَوَامِ مُلْكِ اللهِ",
    "transcription": "Alloohumma solli 'alaa sayyidinaa muhammadin solaatan daa-imatan bidavaami mulkillaah",
    "translation": "Allohim! Sayyidimiz Muhammadga Allohning mulki davom etar ekan, abadiy bo'lgan salovat yo'lla.",
    "reference": "",
    "title_en": "40. Eternal Salawat",
    "title_ar": "40. الصلاة الأبدية",
    "title_id": "40. Shalawat Abadi",
    "narrator_intro_en": "Eternal supplications until Judgment Day.",
    "narrator_intro_ar": "دعوات أبدية إلى يوم القيامة.",
    "narrator_intro_id": "Doa abadi hingga hari kiamat.",
    "translation_en": "O Allah, send eternal blessings upon Muhammad as long as the dominion of Allah endures.",
    "translation_ar": "اللهم صل على سيدنا محمد صلاة دائمة بدوام ملك الله.",
    "translation_id": "Ya Allah, limpahkanlah shalawat abadi atas Muhammad selama kerajaan Allah berlangsung."
  },
  {
    "id": 88,
    "category": "Tonggi",
    "title": "Baraka va rizq so'rash",
    "narrator_intro": "Abu Sa'id al-Xudriy (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ",
    "transcription": "Alloohumma innii as'aluka min fazlika va rohmatik, fa-innahuu laa yamlikuhaa illaa ant",
    "translation": "Allohim! Men Sendan fazling va rahmatingni so'rayman. Zero, bularga faqat Sen egalik qilasan.",
    "reference": "Tabaroniy",
    "title_en": "Asking for Bounty and Sustenance",
    "title_ar": "طلب الفضل والرزق",
    "title_id": "Memohon Karunia dan Rezeki",
    "narrator_intro_en": "Narrated by Abu Said al-Khudri (RA):",
    "narrator_intro_ar": "عن أبي سعيد الخدري رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Said al-Khudri (RA):",
    "translation_en": "O Allah, I ask You of Your bounty and mercy, for none possesses them but You.",
    "translation_ar": "اللهم إني أسألك من فضلك ورحمتك فإنه لا يملكها إلا أنت.",
    "translation_id": "Ya Allah, aku memohon karunia dan rahmat-Mu, karena tiada yang memilikinya selain Engkau."
  },
  {
    "id": 89,
    "category": "Tonggi",
    "title": "Ilm va amal so'rash",
    "narrator_intro": "Ummu Salama (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
    "transcription": "Alloohumma innii as'aluka 'ilman naafi'an, va rizqon toyyiban, va 'amalam mutaqobbalan",
    "translation": "Allohim! Sendan foydali ilm, pokiza rizq va qabul bo'ladigan amal so'rayman.",
    "reference": "Ibn Moja",
    "title_en": "Asking for Knowledge and Deeds",
    "title_ar": "طلب العلم والعمل",
    "title_id": "Memohon Ilmu dan Amal",
    "narrator_intro_en": "Narrated by Umm Salamah (RA):",
    "narrator_intro_ar": "عن أم سلمة رضي الله عنها:",
    "narrator_intro_id": "Diriwayatkan oleh Ummu Salamah (RA):",
    "translation_en": "O Allah, I ask You for beneficial knowledge, good sustenance, and accepted deeds.",
    "translation_ar": "اللهم إني أسألك علماً نافعاً ورزقاً طيباً وعملاً متقبلاً.",
    "translation_id": "Ya Allah, aku memohon ilmu yang bermanfaat, rezeki yang baik, dan amal yang diterima."
  },
  {
    "id": 90,
    "category": "Tonggi",
    "title": "Qarz va g'amdan panoh",
    "narrator_intro": "Abu Sa'id al-Xudriy (r.a)dan rivoyat:",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحُزْنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ",
    "transcription": "Alloohumma innii a'uuzu bika minal hammi val huzn, va a'uuzu bika minal 'ajzi val kasal",
    "translation": "Allohim! Men Sendan g'am-tashvishdan, mahzunlikdan, ojizlikdan va dangasalikdan panoh tilayman.",
    "reference": "Abu Dovud",
    "title_en": "Refuge from Worry and Debt",
    "title_ar": "الاستعاذة من الهم والدين",
    "title_id": "Berlindung dari Kekhawatiran",
    "narrator_intro_en": "Narrated by Abu Said al-Khudri (RA):",
    "narrator_intro_ar": "عن أبي سعيد الخدري رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Said al-Khudri (RA):",
    "translation_en": "O Allah, I seek refuge in You from worry and grief, and from inability and laziness.",
    "translation_ar": "اللهم إني أعوذ بك من الهم والحزن وأعوذ بك من العجز والكسل.",
    "translation_id": "Ya Allah, aku berlindung kepada-Mu dari kekhawatiran, kesedihan, ketidakmampuan, dan kemalasan."
  },
  {
    "id": 91,
    "category": "Tonggi",
    "title": "Do'zahdan panoh (7 marta)",
    "narrator_intro": "Muslim ibn al-Horis (r.a)dan:",
    "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ",
    "transcription": "Alloohumma ajirnii minan naar",
    "translation": "Allohim! Meni do'zahdan asragin.",
    "reference": "Abu Dovud",
    "title_en": "Refuge from Hellfire (7 times)",
    "title_ar": "الاستعاذة من النار (7 مرات)",
    "title_id": "Berlindung dari Neraka (7 kali)",
    "narrator_intro_en": "Narrated by Muslim ibn al-Harith (RA):",
    "narrator_intro_ar": "عن مسلم بن الحارث رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Muslim bin al-Harits (RA):",
    "translation_en": "O Allah, protect me from the Fire.",
    "translation_ar": "اللهم أجرني من النار.",
    "translation_id": "Ya Allah, lindungilah aku dari neraka."
  },
  {
    "id": 92,
    "category": "Tonggi",
    "title": "Shuqr qilish duosi",
    "narrator_intro": "Abdulloh ibn G'anom (r.a)dan:",
    "arabic": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ",
    "transcription": "Alloohumma maa asbaha bii min ni'matin av bi-ahadim min xolqika faminka vahdaka laa shariika lak",
    "translation": "Allohim! Ushbu tongda menga yoki yaratganlaringdan birortasiga berilgan ne'mat Sendandir. Sen yagonasan, sheriging yo'q.",
    "reference": "Abu Dovud",
    "title_en": "Gratitude Supplication",
    "title_ar": "دعاء الشكر",
    "title_id": "Doa Syukur",
    "narrator_intro_en": "Narrated by Abdullah ibn Ghanam (RA):",
    "narrator_intro_ar": "عن عبد الله بن غنم رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abdullah bin Ghanam (RA):",
    "translation_en": "O Allah, whatever blessing I or any of Your creation have received this morning is from You alone, without partner.",
    "translation_ar": "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك.",
    "translation_id": "Ya Allah, nikmat apa pun yang aku atau makhluk-Mu terima pagi ini adalah dari-Mu semata, tiada sekutu bagi-Mu."
  },
  {
    "id": 93,
    "category": "Kechki",
    "title": "Kechki ofiyat",
    "narrator_intro": "Ibn Umar (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي",
    "transcription": "Alloohumma innii as'alukal 'afva val 'aafiyata fiy diiniy va dunyaaya va ahliy va maaliy",
    "translation": "Allohim! Men Sendan dinim, dunyoim, ahlim va molimda afv va ofiyat so'rayman.",
    "reference": "Abu Dovud",
    "title_en": "Evening Well-being",
    "title_ar": "العافية المسائية",
    "title_id": "Keselamatan Sore",
    "narrator_intro_en": "Narrated by Ibn Umar (RA):",
    "narrator_intro_ar": "عن ابن عمر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Umar (RA):",
    "translation_en": "O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family, and my wealth.",
    "translation_ar": "اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي.",
    "translation_id": "Ya Allah, aku memohon maaf dan keselamatan dalam agama, dunia, keluarga, dan hartaku."
  },
  {
    "id": 94,
    "category": "Kechki",
    "title": "Kecha sharidan panoh",
    "narrator_intro": "Abu Hurayra (r.a)dan:",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "transcription": "A'uuzu bikalimaatillaahit taammaati min sharri maa xolaq",
    "translation": "Allohning mukammal kalimalari bilan U yaratgan narsalarning yomonligidan panoh tilayman.",
    "reference": "Muslim",
    "title_en": "Refuge from Night Evil",
    "title_ar": "الاستعاذة من شر الليل",
    "title_id": "Berlindung dari Kejahatan Malam",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
    "translation_ar": "أعوذ بكلمات الله التامات من شر ما خلق.",
    "translation_id": "Aku berlindung dengan kalimat Allah yang sempurna dari keburukan apa yang Dia ciptakan."
  },
  {
    "id": 95,
    "category": "Kechki",
    "title": "Himoya so'rash",
    "narrator_intro": "Rasululloh (s.a.v) duolari:",
    "arabic": "اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي",
    "transcription": "Alloohummah-faznii min bayni yadayya va min xolfiy va 'an yamiiniy va 'an shimaaliy",
    "translation": "Allohim! Meni oldimdan, ortimdan, o'ngimdan, so'limdan va ustimdan O'zing asragin.",
    "reference": "Abu Dovud",
    "title_en": "Seeking Protection",
    "title_ar": "طلب الحماية",
    "title_id": "Memohon Perlindungan",
    "narrator_intro_en": "From the Prophet's supplications (PBUH):",
    "narrator_intro_ar": "من أدعية رسول الله ﷺ:",
    "narrator_intro_id": "Dari doa-doa Rasulullah SAW:",
    "translation_en": "O Allah, protect me from in front, behind, my right, my left, and above me.",
    "translation_ar": "اللهم احفظني من بين يدي ومن خلفي وعن يميني وعن شمالي.",
    "translation_id": "Ya Allah, lindungilah aku dari depan, belakang, kanan, kiri, dan atasku."
  },
  {
    "id": 96,
    "category": "Kechki",
    "title": "Tashvishsiz uyqu",
    "narrator_intro": "Baro ibn Ozib (r.a)dan:",
    "arabic": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ",
    "transcription": "Alloohumma aslamtu nafsiy ilayk, va favvaztu amriy ilayk",
    "translation": "Allohim! Nafsimni Senga topshirdim, ishimni Senga havola qildim.",
    "reference": "Buxoriy",
    "title_en": "Worry-Free Sleep",
    "title_ar": "النوم بلا قلق",
    "title_id": "Tidur Tanpa Cemas",
    "narrator_intro_en": "Narrated by Bara ibn Azib (RA):",
    "narrator_intro_ar": "عن البراء بن عازب رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Bara bin Azib (RA):",
    "translation_en": "O Allah, I have submitted myself to You and entrusted my affairs to You.",
    "translation_ar": "اللهم أسلمت نفسي إليك وفوضت أمري إليك.",
    "translation_id": "Ya Allah, aku menyerahkan diriku kepada-Mu dan menyerahkan urusanku kepada-Mu."
  },
  {
    "id": 97,
    "category": "Kechki",
    "title": "Yomonlikdan uzoqlashish",
    "narrator_intro": "Kechki zikrlardan:",
    "arabic": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ",
    "transcription": "Alloohumma 'aalimal g'oybi vash shahaada, faatiros samaavaati val arz",
    "translation": "G'oyibni va oshkorni biluvchi, yeru osmonni yaratgan Allohim!",
    "reference": "Termiziy",
    "title_en": "Distancing from Evil",
    "title_ar": "البُعد عن الشر",
    "title_id": "Menjauh dari Keburukan",
    "narrator_intro_en": "From evening supplications:",
    "narrator_intro_ar": "من الأذكار المسائية:",
    "narrator_intro_id": "Dari dzikir-dzikir sore:",
    "translation_en": "O Allah, Knower of the unseen and seen, Creator of the heavens and earth!",
    "translation_ar": "اللهم عالم الغيب والشهادة فاطر السماوات والأرض.",
    "translation_id": "Ya Allah, Yang mengetahui yang gaib dan nyata, Pencipta langit dan bumi!"
  },
  {
    "id": 98,
    "category": "Namoz",
    "title": "Azon va Iqomat orasida",
    "narrator_intro": "Anas (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ",
    "transcription": "Alloohumma innii as'alukal 'afva val 'aafiyah",
    "translation": "Allohim! Men Sendan afv va ofiyat so'rayman.",
    "reference": "Termiziy",
    "title_en": "Between Adhan and Iqamah",
    "title_ar": "بين الأذان والإقامة",
    "title_id": "Antara Adzan dan Iqamah",
    "narrator_intro_en": "Narrated by Anas (RA):",
    "narrator_intro_ar": "عن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Anas (RA):",
    "translation_en": "O Allah, I ask You for pardon and well-being.",
    "translation_ar": "اللهم إني أسألك العفو والعافية.",
    "translation_id": "Ya Allah, aku memohon maaf dan keselamatan."
  },
  {
    "id": 99,
    "category": "Namoz",
    "title": "Vasoovasdan panoh",
    "narrator_intro": "Namozda shayton chalg'itganda:",
    "arabic": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "transcription": "A'uuzu billaahi minash shaytoonir rojiim",
    "translation": "Quvilgan shaytonning yomonligidan Allohdan panoh tilayman.",
    "reference": "Muslim",
    "title_en": "Refuge from Waswas",
    "title_ar": "الاستعاذة من الوسوسة",
    "title_id": "Berlindung dari Was-was",
    "narrator_intro_en": "When Satan distracts in prayer:",
    "narrator_intro_ar": "عند وسوسة الشيطان في الصلاة:",
    "narrator_intro_id": "Ketika setan mengganggu dalam shalat:",
    "translation_en": "I seek refuge in Allah from the accursed Satan.",
    "translation_ar": "أعوذ بالله من الشيطان الرجيم.",
    "translation_id": "Aku berlindung kepada Allah dari setan yang terkutuk."
  },
  {
    "id": 100,
    "category": "Namoz",
    "title": "Rukuda aytiladigan zikr",
    "narrator_intro": "Subhuna Rabbiyal 'Aziym o'rniga:",
    "arabic": "سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
    "transcription": "Subbuuhun qudduusun robbul malaaikati var ruuh",
    "translation": "Suhbuuhdir, Qudduusdir, farishtalar va Ruhning (Jibroilning) Robbidir.",
    "reference": "Muslim",
    "title_en": "Dhikr in Ruku",
    "title_ar": "ذكر الركوع",
    "title_id": "Dzikir dalam Rukuk",
    "narrator_intro_en": "Instead of Subhana Rabbiyal Azim:",
    "narrator_intro_ar": "بدلاً عن سبحان ربي العظيم:",
    "narrator_intro_id": "Sebagai pengganti Subhana Rabbiyal Azhim:",
    "translation_en": "Most Glorious, Most Holy, Lord of the angels and the Spirit.",
    "translation_ar": "سبّوح قدّوس رب الملائكة والروح.",
    "translation_id": "Mahasuci, Mahakudus, Tuhan para malaikat dan Ruh."
  },
  {
    "id": 101,
    "category": "Namoz",
    "title": "Tashahhuddan keyingi duo",
    "narrator_intro": "Abu Bakr (r.a)ga o'rgatilgan duo:",
    "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "transcription": "Alloohumma innii zolamtu nafsiy zulman kasiiron va laa yag'firuz zunuuba illaa ant",
    "translation": "Allohim! Men nafsimga ko'p zulm qildim. Gunohlarni faqat Sen kechirasan.",
    "reference": "Buxoriy",
    "title_en": "Dua After Tashahhud",
    "title_ar": "الدعاء بعد التشهد",
    "title_id": "Doa Setelah Tasyahhud",
    "narrator_intro_en": "Dua taught to Abu Bakr (RA):",
    "narrator_intro_ar": "دعاء عُلّم لأبي بكر رضي الله عنه:",
    "narrator_intro_id": "Doa yang diajarkan kepada Abu Bakar (RA):",
    "translation_en": "O Allah, I have greatly wronged myself and none forgives sins but You.",
    "translation_ar": "اللهم إني ظلمت نفسي ظلماً كثيراً ولا يغفر الذنوب إلا أنت.",
    "translation_id": "Ya Allah, aku telah banyak menzalimi diriku dan tiada yang mengampuni dosa kecuali Engkau."
  },
  {
    "id": 102,
    "category": "Namoz",
    "title": "Salomdan keyingi zikr",
    "narrator_intro": "Savbon (r.a)dan:",
    "arabic": "أَسْتَغْفِرُ اللهَ (3)، اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
    "transcription": "Astog'firullooh (3 marta), Alloohumma antas salaamu va minkas salaamu tabaarokta yaa zal jalaali val ikroom",
    "translation": "Allohdan mag'firat so'rayman. Allohim! Sen Salom (omonlik beruvchi)san va omonlik Sendandir. Ey ulug'lik va ikrom egasi, Sen barakotlidirsan.",
    "reference": "Muslim",
    "title_en": "Dhikr After Salam",
    "title_ar": "الذكر بعد السلام",
    "title_id": "Dzikir Setelah Salam",
    "narrator_intro_en": "Narrated by Thawban (RA):",
    "narrator_intro_ar": "عن ثوبان رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Tsauban (RA):",
    "translation_en": "I seek Allah's forgiveness (3x). O Allah, You are Peace and from You is peace. Blessed are You, O Possessor of Majesty and Honor.",
    "translation_ar": "أستغفر الله (3). اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام.",
    "translation_id": "Aku memohon ampun kepada Allah (3x). Ya Allah, Engkau Maha Sejahtera dan dari-Mu keselamatan. Maha Berkah Engkau, wahai pemilik keagungan dan kemuliaan."
  },
  {
    "id": 103,
    "category": "Kundalik",
    "title": "Ko'zguga qaraganda",
    "narrator_intro": "Ibn Mas'ud (r.a)dan:",
    "arabic": "اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "transcription": "Alloohumma kamaa hassanta xolqiy fahassin xuluqiy",
    "translation": "Allohim! Mening qiyofamni (yaratilishimni) go'zal qilganingdek, xulqimni ham go'zal qilgin.",
    "reference": "Ahmad",
    "title_en": "Looking in the Mirror",
    "title_ar": "النظر في المرآة",
    "title_id": "Bercermin",
    "narrator_intro_en": "Narrated by Ibn Masud (RA):",
    "narrator_intro_ar": "عن ابن مسعود رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Masud (RA):",
    "translation_en": "O Allah, as You have perfected my outward form, perfect my character.",
    "translation_ar": "اللهم كما حسنت خلقي فحسن خلقي.",
    "translation_id": "Ya Allah, sebagaimana Engkau telah memperindah rupa-ku, perindahlah akhlakku."
  },
  {
    "id": 104,
    "category": "Kundalik",
    "title": "Sut ichganda",
    "narrator_intro": "Ibn Abbos (r.a)dan:",
    "arabic": "اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",
    "transcription": "Alloohumma baarik lanaa fiihi va zidnaa minhu",
    "translation": "Allohim! Bizga bunda baraka ber va bizga uni ko'paytirib ber.",
    "reference": "Termiziy",
    "title_en": "When Drinking Milk",
    "title_ar": "عند شرب اللبن",
    "title_id": "Ketika Minum Susu",
    "narrator_intro_en": "Narrated by Ibn Abbas (RA):",
    "narrator_intro_ar": "عن ابن عباس رضي الله عنهما:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Abbas (RA):",
    "translation_en": "O Allah, bless us in it and increase it for us.",
    "translation_ar": "اللهم بارك لنا فيه وزدنا منه.",
    "translation_id": "Ya Allah, berkahilah kami padanya dan tambahkanlah untuk kami."
  },
  {
    "id": 105,
    "category": "Kundalik",
    "title": "Majlisdan turganda",
    "narrator_intro": "Abu Hurayra (r.a)dan:",
    "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
    "transcription": "Subhaanakalloohumma va bihamdik, ash-hadu alla ilaaha illaa ant, astog'firuka va atuubu ilayk",
    "translation": "Allohim! Sen poksan, Senga hamd bo'lsin. Sendan o'zga iloh yo'qligiga guvohlik beraman. Sendan mag'firat so'rayman va Senga tavba qilaman.",
    "reference": "Termiziy",
    "title_en": "When Leaving a Gathering",
    "title_ar": "عند القيام من المجلس",
    "title_id": "Ketika Meninggalkan Majelis",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "Glory be to You, O Allah, and praise. I bear witness there is no god but You. I seek Your forgiveness and repent to You.",
    "translation_ar": "سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك.",
    "translation_id": "Mahasuci Engkau ya Allah, segala puji bagi-Mu. Aku bersaksi tiada tuhan selain Engkau. Aku memohon ampun dan bertaubat kepada-Mu."
  },
  {
    "id": 106,
    "category": "Kundalik",
    "title": "Yaxshilik qilganga duo",
    "narrator_intro": "Usoma ibn Zayd (r.a)dan:",
    "arabic": "جَزَاكَ اللهُ خَيْرًا",
    "transcription": "Jazaakalloohu xoyron",
    "translation": "Alloh seni yaxshilik bilan mukofotlasin.",
    "reference": "Termiziy",
    "title_en": "Dua for Someone Who Does Good",
    "title_ar": "دعاء لمن أحسن إليك",
    "title_id": "Doa untuk yang Berbuat Baik",
    "narrator_intro_en": "Narrated by Usamah ibn Zayd (RA):",
    "narrator_intro_ar": "عن أسامة بن زيد رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Usamah bin Zaid (RA):",
    "translation_en": "May Allah reward you with good.",
    "translation_ar": "جزاك الله خيراً.",
    "translation_id": "Semoga Allah membalasmu dengan kebaikan."
  },
  {
    "id": 107,
    "category": "Kundalik",
    "title": "G'azab kelganda",
    "narrator_intro": "Sulaymon ibn Surad (r.a)dan:",
    "arabic": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "transcription": "A'uuzu billaahi minash shaytoonir rojiim",
    "translation": "Quvilgan shaytonning yomonligidan Allohdan panoh tilayman.",
    "reference": "Buxoriy",
    "title_en": "When Feeling Angry",
    "title_ar": "عند الغضب",
    "title_id": "Ketika Marah",
    "narrator_intro_en": "Narrated by Sulayman ibn Surad (RA):",
    "narrator_intro_ar": "عن سليمان بن صرد رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Sulaiman bin Shurad (RA):",
    "translation_en": "I seek refuge in Allah from the accursed Satan.",
    "translation_ar": "أعوذ بالله من الشيطان الرجيم.",
    "translation_id": "Aku berlindung kepada Allah dari setan yang terkutuk."
  },
  {
    "id": 108,
    "category": "Safar",
    "title": "Safari qiyinlashganda",
    "narrator_intro": "Rasululloh (s.a.v) safar duolari:",
    "arabic": "اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ",
    "transcription": "Alloohumma havvin 'alaynaa safaronaa haazaa, vatvi 'annaa bu'dah",
    "translation": "Allohim! Ushbu safarimizni bizga oson qilgin va uning uzoqligini yaqin qilgin.",
    "reference": "Muslim",
    "title_en": "When Journey Becomes Difficult",
    "title_ar": "عند صعوبة السفر",
    "title_id": "Ketika Perjalanan Menjadi Sulit",
    "narrator_intro_en": "From the Prophet's travel supplications:",
    "narrator_intro_ar": "من أدعية سفر رسول الله ﷺ:",
    "narrator_intro_id": "Dari doa-doa safar Rasulullah SAW:",
    "translation_en": "O Allah, ease this journey for us and shorten its distance.",
    "translation_ar": "اللهم هوّن علينا سفرنا هذا واطو عنا بُعده.",
    "translation_id": "Ya Allah, mudahkanlah perjalanan ini dan dekatkanlah jaraknya."
  },
  {
    "id": 109,
    "category": "Safar",
    "title": "Safar xavfidan panoh",
    "narrator_intro": "Ibn Umar (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ",
    "transcription": "Alloohumma innii a'uuzu bika min va'saais safari va kaabatiil manzor",
    "translation": "Allohim! Safar qiyinchiligidan va g'amgin manzaralardan Sendan panoh tilayman.",
    "reference": "Muslim",
    "title_en": "Refuge from Travel Danger",
    "title_ar": "الاستعاذة من خطر السفر",
    "title_id": "Berlindung dari Bahaya Perjalanan",
    "narrator_intro_en": "Narrated by Ibn Umar (RA):",
    "narrator_intro_ar": "عن ابن عمر رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Ibnu Umar (RA):",
    "translation_en": "O Allah, I seek refuge in You from the hardship of travel and the sight of sadness.",
    "translation_ar": "اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر.",
    "translation_id": "Ya Allah, aku berlindung kepada-Mu dari kesulitan perjalanan dan pemandangan yang menyedihkan."
  },
  {
    "id": 110,
    "category": "Safar",
    "title": "Tonggi safar zikri",
    "narrator_intro": "Abu Hurayra (r.a)dan:",
    "arabic": "سَمِعَ سَامِعٌ بِحَمْدِ اللهِ وَحُسْنِ بَلَائِهِ عَلَيْنَا",
    "transcription": "Sami'a saami'un bihamdillaahi va husni balaaihii 'alaynaa",
    "translation": "Allohning bizga bergan hamdi va go'zal sinovini bir eshituvchi qabul qilsin.",
    "reference": "Muslim",
    "title_en": "Morning Travel Dhikr",
    "title_ar": "ذكر السفر الصباحي",
    "title_id": "Dzikir Safar Pagi",
    "narrator_intro_en": "Narrated by Abu Hurayrah (RA):",
    "narrator_intro_ar": "عن أبي هريرة رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Abu Hurairah (RA):",
    "translation_en": "A listener has heard the praise of Allah and His beautiful trial upon us.",
    "translation_ar": "سمع سامع بحمد الله وحسن بلائه علينا.",
    "translation_id": "Semoga yang mendengar menerima pujian kepada Allah dan ujian-Nya yang indah atas kami."
  },
  {
    "id": 111,
    "category": "Safar",
    "title": "Kema yoki qayiqqa minganda",
    "narrator_intro": "Hud surasi, 41-oyat:",
    "arabic": "بِسْمِ اللهِ مَجْرَاهَا وَمُرْسَاهَا، إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ",
    "transcription": "Bismillaahi majreehaa va murseehaa, inna robbiy lag'ofuurur rohiim",
    "translation": "Uning (kemaning) suzishi ham, to'xtashi ham Allohning ismi bilandir. Albatta, Robbim mag'firatli va rahmlidir.",
    "reference": "Qur'oni Karim",
    "title_en": "When Boarding a Ship",
    "title_ar": "عند ركوب السفينة",
    "title_id": "Ketika Naik Kapal",
    "narrator_intro_en": "Quran (Hud: 41):",
    "narrator_intro_ar": "سورة هود: 41:",
    "narrator_intro_id": "Al-Quran (Hud: 41):",
    "translation_en": "In the Name of Allah its sailing and anchoring. My Lord is All-Forgiving, Most Merciful.",
    "translation_ar": "بسم الله مجراها ومرساها إن ربي لغفور رحيم.",
    "translation_id": "Dengan nama Allah berlayar dan berlabuhnya. Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyayang."
  },
  {
    "id": 112,
    "category": "Oila",
    "title": "Solih farzand so'rash",
    "narrator_intro": "Zakariyo (a.s) duosi (Anbiyo: 89):",
    "arabic": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ",
    "transcription": "Robbi laa tazarniy fardan va anta xoyrul vaarisiin",
    "translation": "Robbim! Meni yolg'iz tashlab qo'yma (zurriyot ber), Sen vorislarning eng yaxshisidirsan.",
    "reference": "Qur'oni Karim",
    "title_en": "Asking for Righteous Child",
    "title_ar": "طلب الولد الصالح",
    "title_id": "Memohon Anak Shaleh",
    "narrator_intro_en": "Dua of Zakariya (AS) - Al-Anbiya: 89:",
    "narrator_intro_ar": "دعاء زكريا عليه السلام (الأنبياء: 89):",
    "narrator_intro_id": "Doa Zakariya (AS) - Al-Anbiya: 89:",
    "translation_en": "My Lord, do not leave me alone, and You are the best of inheritors.",
    "translation_ar": "رب لا تذرني فرداً وأنت خير الوارثين.",
    "translation_id": "Tuhanku, janganlah Engkau biarkan aku sendiri, dan Engkau adalah sebaik-baik pemberi warisan."
  },
  {
    "id": 113,
    "category": "Oila",
    "title": "Xotin va zurriyot uchun",
    "narrator_intro": "Furqon surasi, 74-oyat:",
    "arabic": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ",
    "transcription": "Robbanaa hab lanaa min azvaajinaa va zurriyyaatinaa qurrota a'yun",
    "translation": "Robbimiz! Bizga jufti halollarimizdan va zurriyotlarimizdan ko'z quvonchini ato etgin.",
    "reference": "Qur'oni Karim",
    "title_en": "For Spouse and Offspring",
    "title_ar": "للزوجة والذرية",
    "title_id": "Untuk Pasangan dan Keturunan",
    "narrator_intro_en": "Surah Al-Furqan, verse 74:",
    "narrator_intro_ar": "سورة الفرقان، آية 74:",
    "narrator_intro_id": "Surah Al-Furqan, ayat 74:",
    "translation_en": "Our Lord, grant us from our spouses and offspring comfort to our eyes.",
    "translation_ar": "ربنا هب لنا من أزواجنا وذرياتنا قرة أعين.",
    "translation_id": "Tuhan kami, karuniakanlah kepada kami dari pasangan dan keturunan kami penyejuk mata."
  },
  {
    "id": 114,
    "category": "Oila",
    "title": "Farzandga baraka",
    "narrator_intro": "Rasululloh (s.a.v) tavsiyalari:",
    "arabic": "اللَّهُمَّ بَارِكْ فِيهِمْ وَبَارِكْ لَهُمْ",
    "transcription": "Alloohumma baarik fiihim va baarik lahum",
    "translation": "Allohim! Ularning (farzandlarning) o'zlariga va ishlariga baraka bergin.",
    "reference": "Termiziy",
    "title_en": "Blessing for Children",
    "title_ar": "بركة الأولاد",
    "title_id": "Berkah untuk Anak-anak",
    "narrator_intro_en": "From Prophet's recommendations (PBUH):",
    "narrator_intro_ar": "من توصيات رسول الله ﷺ:",
    "narrator_intro_id": "Dari anjuran Rasulullah SAW:",
    "translation_en": "O Allah, bless them in themselves and bless them in their affairs.",
    "translation_ar": "اللهم بارك فيهم وبارك لهم.",
    "translation_id": "Ya Allah, berkahilah mereka dalam diri mereka dan berkahilah urusan mereka."
  },
  {
    "id": 115,
    "category": "Oila",
    "title": "Yaxshi hayot so'rash",
    "narrator_intro": "Oila tinchligi uchun:",
    "arabic": "اللَّهُمَّ أَصْلِحْ لِي فِي ذُرِّيَّتِي",
    "transcription": "Alloohumma aslih lii fiy zurriyyatiy",
    "translation": "Allohim! Zurriyotimni (naslimni) men uchun isloh qilgin (yaxshi qilib ber).",
    "reference": "Ahqof: 15",
    "title_en": "Asking for Good Life",
    "title_ar": "طلب الحياة الطيبة",
    "title_id": "Memohon Kehidupan Baik",
    "narrator_intro_en": "For family peace:",
    "narrator_intro_ar": "لسكينة الأسرة:",
    "narrator_intro_id": "Untuk kedamaian keluarga:",
    "translation_en": "O Allah, set right for me among my offspring.",
    "translation_ar": "اللهم أصلح لي في ذريتي.",
    "translation_id": "Ya Allah, perbaikilah untukku keturunanku."
  },
  {
    "id": 116,
    "category": "Juma",
    "title": "Juma kuni duosi",
    "narrator_intro": "Juma kuni aytiladigan zikr:",
    "arabic": "اللَّهُمَّ اجْعَلْ خَيْرَ أَيَّامِي يَوْمَ لِقَائِكَ",
    "transcription": "Alloohummaj'al xoyro ayyaamiy yavma liqoo'ik",
    "translation": "Allohim! Kunlarimning eng yaxshisini Senga muloqot qiladigan kunim qilgin.",
    "reference": "",
    "title_en": "Friday Supplication",
    "title_ar": "دعاء الجمعة",
    "title_id": "Doa Jumat",
    "narrator_intro_en": "Friday dhikr:",
    "narrator_intro_ar": "ذكر يوم الجمعة:",
    "narrator_intro_id": "Dzikir hari Jumat:",
    "translation_en": "O Allah, make the best of my days the day I meet You.",
    "translation_ar": "اللهم اجعل خير أيامي يوم لقائك.",
    "translation_id": "Ya Allah, jadikanlah hari terbaikku adalah hari pertemuanku dengan-Mu."
  },
  {
    "id": 117,
    "category": "Juma",
    "title": "Faqirlikdan panoh",
    "narrator_intro": "Juma kuni suralari orasida:",
    "arabic": "اللَّهُمَّ غَنِّي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "transcription": "Alloohumma g'onnii bifazlika 'amman sivaak",
    "translation": "Allohim! O'z fazling bilan meni O'zingdan boshqalardan boy (ehtiyojsiz) qilgin.",
    "reference": "",
    "title_en": "Refuge from Poverty",
    "title_ar": "الاستعاذة من الفقر",
    "title_id": "Berlindung dari Kemiskinan",
    "narrator_intro_en": "From Friday supplications:",
    "narrator_intro_ar": "من أدعية يوم الجمعة:",
    "narrator_intro_id": "Dari doa-doa hari Jumat:",
    "translation_en": "O Allah, enrich me by Your bounty from depending on others.",
    "translation_ar": "اللهم غنّي بفضلك عمن سواك.",
    "translation_id": "Ya Allah, cukupkanlah aku dengan karunia-Mu dari bergantung pada selain-Mu."
  },
  {
    "id": 118,
    "category": "Juma",
    "title": "Tinchlik va ofiyat",
    "narrator_intro": "Juma ayyomidagi duo:",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْأَمْنَ وَالْإِيمَانَ",
    "transcription": "Alloohumma innii as'alukal amna val iimaan",
    "translation": "Allohim! Men Sendan omonlik va iymon (mustahkamligini) so'rayman.",
    "reference": "",
    "title_en": "Peace and Faith",
    "title_ar": "السلام والإيمان",
    "title_id": "Kedamaian dan Keimanan",
    "narrator_intro_en": "Friday supplication:",
    "narrator_intro_ar": "دعاء يوم الجمعة:",
    "narrator_intro_id": "Doa hari Jumat:",
    "translation_en": "O Allah, I ask You for security and faith.",
    "translation_ar": "اللهم إني أسألك الأمن والإيمان.",
    "translation_id": "Ya Allah, aku memohon keamanan dan keimanan."
  },
  {
    "id": 119,
    "category": "Ramazon",
    "title": "Saharlik duosi",
    "narrator_intro": "Ro'za tutish niyati:",
    "arabic": "نَوَيْتُ أَنْ أَصُومَ صَوْمَ شَهْرِ رَمَضَانَ مِنَ الْفَجْرِ إِلَى الْمَغْرِبِ",
    "transcription": "Navaytu an asuuma sovma shahri ramazona minal fajri ilal mag'rib",
    "translation": "Ramazon oyining ro'zasini tongdan to quyosh botguncha tutishni niyat qildim.",
    "reference": "An'anaviy",
    "title_en": "Suhoor (Pre-Dawn) Supplication",
    "title_ar": "دعاء السحور",
    "title_id": "Doa Sahur",
    "narrator_intro_en": "Intention for fasting:",
    "narrator_intro_ar": "نية الصيام:",
    "narrator_intro_id": "Niat puasa:",
    "translation_en": "I intend to fast the month of Ramadan from dawn to sunset.",
    "translation_ar": "نويت أن أصوم صوم شهر رمضان من الفجر إلى المغرب.",
    "translation_id": "Aku berniat puasa Ramadhan dari fajar hingga maghrib."
  },
  {
    "id": 120,
    "category": "Ramazon",
    "title": "Birovda iftorlik qilganda",
    "narrator_intro": "Anas (r.a)dan:",
    "arabic": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الْأَبْرَارُ",
    "transcription": "Aftoro 'indakumus soo-imuun, va akala to'aamakumul abroor",
    "translation": "Huzuringizda ro'zadoylar iftor qilsin, taomingizni solihlar yesin.",
    "reference": "Abu Dovud",
    "title_en": "When Breaking Fast at Someone's Place",
    "title_ar": "الإفطار عند الغير",
    "title_id": "Berbuka di Tempat Orang Lain",
    "narrator_intro_en": "Narrated by Anas (RA):",
    "narrator_intro_ar": "عن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Anas (RA):",
    "translation_en": "May the fasting ones break their fast at your place, and may the righteous eat your food.",
    "translation_ar": "أفطر عندكم الصائمون وأكل طعامكم الأبرار.",
    "translation_id": "Semoga orang-orang yang berpuasa berbuka di tempatmu, dan semoga orang-orang saleh memakan makananmu."
  },
  {
    "id": 121,
    "category": "Ramazon",
    "title": "Iymon bilan ro'za",
    "narrator_intro": "Iftorda gunoh so'rash:",
    "arabic": "اللَّهُمَّ لَكَ صُمْتُ وَبِكَ آمَنْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ",
    "transcription": "Alloohumma laka sumtu va bika aamantu va 'alaa rizqika aftortu",
    "translation": "Allohim! Sen uchun ro'za tutdim, Senga iymon keltirdim va Sening rizqing bilan iftor qildim.",
    "reference": "Abu Dovud",
    "title_en": "Faith and Fasting",
    "title_ar": "الإيمان والصيام",
    "title_id": "Iman dan Puasa",
    "narrator_intro_en": "Iftar supplication:",
    "narrator_intro_ar": "دعاء عند الإفطار:",
    "narrator_intro_id": "Doa saat berbuka:",
    "translation_en": "O Allah, for You I fasted, in You I believed, and with Your sustenance I break my fast.",
    "translation_ar": "اللهم لك صمت وبك آمنت وعلى رزقك أفطرت.",
    "translation_id": "Ya Allah, untuk-Mu aku berpuasa, kepada-Mu aku beriman, dan dengan rezeki-Mu aku berbuka."
  },
  {
    "id": 122,
    "category": "Haj",
    "title": "Hajda ofiyat so'rash",
    "narrator_intro": "Tavof paytida:",
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً",
    "transcription": "Robbanaa aatinaa fid dunyaa hasanatan va fil aaxiroti hasanatan",
    "translation": "Robbimiz! Bizga dunyoda ham yaxshilik, oxiratda ham yaxshilik ato etgin.",
    "reference": "Baqara: 201",
    "title_en": "Seeking Wellbeing in Hajj",
    "title_ar": "طلب العافية في الحج",
    "title_id": "Memohon Keselamatan dalam Haji",
    "narrator_intro_en": "During Tawaf:",
    "narrator_intro_ar": "أثناء الطواف:",
    "narrator_intro_id": "Saat Tawaf:",
    "translation_en": "Our Lord, give us good in this world and good in the Hereafter.",
    "translation_ar": "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة.",
    "translation_id": "Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat."
  },
  {
    "id": 123,
    "category": "Haj",
    "title": "Zulmatdan panoh",
    "narrator_intro": "Arafotda aytiladigan zikr:",
    "arabic": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا",
    "transcription": "Alloohummaj'al fiy qolbiy nuuroo",
    "translation": "Allohim! Qalbimda nur paydo qilgin.",
    "reference": "Muslim",
    "title_en": "Refuge from Darkness",
    "title_ar": "الاستعاذة من الظلمة",
    "title_id": "Berlindung dari Kegelapan",
    "narrator_intro_en": "Dhikr said at Arafat:",
    "narrator_intro_ar": "ذكر يُقال في عرفات:",
    "narrator_intro_id": "Dzikir di Arafah:",
    "translation_en": "O Allah, place light in my heart.",
    "translation_ar": "اللهم اجعل في قلبي نوراً.",
    "translation_id": "Ya Allah, jadikanlah cahaya di hatiku."
  },
  {
    "id": 124,
    "category": "Haj",
    "title": "Haj amallarini qabulini so'rash",
    "narrator_intro": "Ibrohim (a.s) va Ismoil (a.s) duolari:",
    "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ",
    "transcription": "Robbanaa taqobbal minnaa, innaka antas samii'ul 'aliim",
    "translation": "Robbimiz! Bizdan (bu amallarimizni) qabul qil! Albatta, Sen eshituvchi va biluvchisan.",
    "reference": "Qur'oni Karim",
    "title_en": "Asking for Acceptance of Hajj",
    "title_ar": "طلب قبول الحج",
    "title_id": "Memohon Diterimanya Haji",
    "narrator_intro_en": "Dua of Ibrahim (AS) and Ismail (AS):",
    "narrator_intro_ar": "دعاء إبراهيم وإسماعيل عليهما السلام:",
    "narrator_intro_id": "Doa Ibrahim (AS) dan Ismail (AS):",
    "translation_en": "Our Lord, accept from us. Indeed, You are the Hearing, the Knowing.",
    "translation_ar": "ربنا تقبل منا إنك أنت السميع العليم.",
    "translation_id": "Tuhan kami, terimalah dari kami. Sesungguhnya Engkau Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "id": 125,
    "category": "Bemorlik",
    "title": "Bemor uchun istiaz",
    "narrator_intro": "Jibril (a.s) Payg'ambarimizga o'qiganlari:",
    "arabic": "بِاسْمِ اللهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ",
    "transcription": "Bismillaahi arqiyka, min kulli shay'iy yu'ziyka",
    "translation": "Seni ozor beradigan barcha narsadan Allohning ismi bilan dam solaman.",
    "reference": "Muslim",
    "title_en": "Ruqyah for the Sick",
    "title_ar": "رقية المريض",
    "title_id": "Ruqyah untuk Orang Sakit",
    "narrator_intro_en": "What Jibril (AS) recited for the Prophet:",
    "narrator_intro_ar": "ما رقى جبريل عليه السلام به النبي ﷺ:",
    "narrator_intro_id": "Yang dibacakan Jibril (AS) untuk Nabi SAW:",
    "translation_en": "In the Name of Allah I perform ruqyah upon you, from everything that harms you.",
    "translation_ar": "باسم الله أرقيك من كل شيء يؤذيك.",
    "translation_id": "Dengan nama Allah aku meruqyahmu dari segala sesuatu yang menyakitimu."
  },
  {
    "id": 126,
    "category": "Bemorlik",
    "title": "Qiyin darddan panoh",
    "narrator_intro": "Anas (r.a)dan:",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ",
    "transcription": "Alloohumma innii a'uuzu bika minal barosi val junuuni val juzoom",
    "translation": "Allohim! Men Sendan peslik, jinnilik va moxovlik kabi yomon dardlardan panoh tilayman.",
    "reference": "Abu Dovud",
    "title_en": "Refuge from Severe Illness",
    "title_ar": "الاستعاذة من الأمراض الخطيرة",
    "title_id": "Berlindung dari Penyakit Berat",
    "narrator_intro_en": "Narrated by Anas (RA):",
    "narrator_intro_ar": "عن أنس رضي الله عنه:",
    "narrator_intro_id": "Diriwayatkan oleh Anas (RA):",
    "translation_en": "O Allah, I seek refuge in You from leprosy, insanity, and evil diseases.",
    "translation_ar": "اللهم إني أعوذ بك من البرص والجنون والجذام.",
    "translation_id": "Ya Allah, aku berlindung kepada-Mu dari lepra, kegilaan, dan penyakit buruk."
  },
  {
    "id": 127,
    "category": "Qabr",
    "title": "Qabr azobidan panoh",
    "narrator_intro": "Namoz oxirida aytiladigan:",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ",
    "transcription": "Alloohumma innii a'uuzu bika min 'azaabil qobr",
    "translation": "Allohim! Men Sendan qabr azobidan panoh tilayman.",
    "reference": "Buxoriy",
    "title_en": "Refuge from Grave Punishment",
    "title_ar": "الاستعاذة من عذاب القبر",
    "title_id": "Berlindung dari Siksa Kubur",
    "narrator_intro_en": "Said at the end of prayer:",
    "narrator_intro_ar": "يُقال في آخر الصلاة:",
    "narrator_intro_id": "Dibaca di akhir shalat:",
    "translation_en": "O Allah, I seek refuge in You from the punishment of the grave.",
    "translation_ar": "اللهم إني أعوذ بك من عذاب القبر.",
    "translation_id": "Ya Allah, aku berlindung kepada-Mu dari siksa kubur."
  }
]