Repository: link-edition/muslim-pro
Catalog: lib/l10n/app_*.arb
Languages: id, uz

source: Settings
id: Pengaturan
uz: Sozlamalar

source: General
id: Umum
uz: Umumiy

source: Language
id: Bahasa
uz: Til

# theme
source: App Theme
id: Tema Aplikasi
uz: Ilova mavzusi

source: Dark Mode
id: Mode Gelap
uz: Tungi rejim

source: Light Mode
id: Mode Terang
uz: Kunduzgi rejim

source: Font Size
id: Ukuran Font
uz: Shrift o'lchami

source: Notifications
id: Notifikasi
uz: Bildirishnomalar

source: Adhan Voice
id: Suara Adzan
uz: Azon ovozi

# pre_prayer_reminder
source: Pre-prayer Reminder (10 min)
id: Pengingat Sebelum Shalat (10 mnt)
uz: Namozdan oldin eslatma (10 daq)

# juma_reminder
source: Jumu'ah Salawat Reminder
id: Pengingat Shalawat Jumat
uz: Juma salovoti eslatmasi

# test_adhan
source: Test Adhan (in 3 sec)
id: Uji Adzan (dalam 3 dtk)
uz: Azonni sinash (3 soniyada)

# test_adhan_msg
source: Close the app, Adhan will play shortly
id: Tutup aplikasi, Adzan akan segera berkumandang
uz: Ilovani yoping, tez oradan Azon chalinadi

source: About
id: Tentang
uz: Haqida

source: Version
id: Versi
uz: Versiya

# team
source: Our Team
id: Tim Kami
uz: Jamoamiz

# assalom
source: As-salamu alaykum
id: Assalamu'alaikum
uz: Assalomu alaykum

source: Next prayer
id: Waktu shalat berikutnya
uz: Keyingi namoz

source: Audio Qur'an
id: Audio Al-Qur'an
uz: Audio Qur'on

# quran_menu
source: Noble Qur'an
id: Al-Qur'an Mulia
uz: Qur'oni Karim

# mushaf
source: Mushaf (Tajweed)
id: Mushaf (Tajwid)
uz: Mushaf (Tajvidli)

# duas
source: Duas and Salawat
id: Doa & Shalawat
uz: Duolar va Salovatlar

# tasbeh
source: Tasbeeh
id: Tasbih
uz: Tasbeh

# bomdod
source: Fajr
id: Subuh
uz: Bomdod

# peshin
source: Dhuhr
id: Dzuhur
uz: Peshin

# shom
source: Maghrib
uz: Shom

# xufton
source: Isha
id: Isya
uz: Xufton

source: Search Surah...
id: Cari Surah...
uz: Sura qidirish...

# quran_karim
source: Qur'an
id: Al-Qur'an
uz: Qur'on

# sura
source: Surah
uz: Sura

# oyat
source: AYAH
id: AYAT
uz: OYAT

# copy_success
source: Ayah copied
id: Ayat disalin
uz: Oyat nusxalandi

# share_msg
source: — from Amal app
id: — dari aplikasi Amal
uz: — Amal ilovasidan

source: History & Stats
id: Riwayat & Statistik
uz: Tarix va Statistika

# zikr_counter
source: Dhikr Counter
id: Penghitung Dzikir
uz: Zikr sanagich

source: Select Language
id: Pilih Bahasa
uz: Tilni tanlang

source: hours
id: jam
uz: soat

source: minutes
id: menit
uz: daqiqa

source: seconds
id: detik
uz: soniya

source: Listen
id: Dengarkan
uz: Tinglash

# menu_subtitle_dua
source: via Entrance menu
id: via Menu Masuk
uz: Kirish menyusi orqali

# zikr_subtitle
source: Dhikr counter
id: Penghitung Dzikir
uz: Zikr sanagich

# qibla_subtitle
source: Direction
id: Arah
uz: Yo'nalish

source: MECCAN
id: MAKKIYAH
uz: MAKKIY

source: MEDINAN
id: MADANIYAH
uz: MADANIY

# subhanalloh
source: SubhanAllah
uz: Subhanalloh

# astaghfirulloh
source: Astaghfirullah
uz: Astaghfirulloh

# total_count
source: Total:
uz: Jami:

# custom_zikr_hint
source: Write custom dhikr...
id: Tulis dzikir kustom...
uz: Shaxsiy zikr yozish...

# tonggi_duolar
source: Morning Duas
id: Doa Pagi
uz: Tonggi duolar

# kechki_duolar
source: Evening Duas
id: Doa Sore
uz: Kechki duolar

# namoz_duolari
source: Prayer Duas
id: Doa Shalat
uz: Namoz duolari

# kundalik_duolar
source: Daily Duas
id: Doa Sehari-hari
uz: Kundalik duolar

# safar_duolari
source: Travel Duas
id: Doa Safar
uz: Safar duolari

# oila_duolari
source: Family Duas
id: Doa Keluarga
uz: Oila duolari

# juma_duolari
source: Friday Duas
id: Doa Jumat
uz: Juma duolari

# ramazon_duolari
source: Ramadan Duas
id: Doa Ramadhan
uz: Ramazon duolari

# haj_va_umra
source: Hajj & Umrah
id: Haji & Umrah
uz: Haj va Umra

# bemorlik
source: Illness
id: Orang Sakit
uz: Bemorlik

# qabr_ziyorati
source: Grave Visitation
id: Ziarah Kubur
uz: Qabr ziyorati

# salovatlar
source: Salawat
id: Shalawat
uz: Salovatlar

# error_occured
source: An error occurred
id: Terjadi kesalahan
uz: Xatolik yuz berdi

# namoz_times
source: Prayer Times
id: Waktu Shalat
uz: Namoz vaqtlari

source: Current Location
id: Lokasi Saat Ini
uz: Joriy joylashuv

source: Change
id: Ubah
uz: O'zgartirish

source: Select City
id: Pilih Kota
uz: Shaharni tanlash

# search_city_hint
source: Type city name...
id: Ketik nama kota...
uz: Shahar nomini yozing...

source: My Location (GPS)
id: Lokasi Saya (GPS)
uz: Mening joylashuvim (GPS)

# auto_detection
source: Auto Detect
id: Deteksi Otomatis
uz: Avtomatik aniqlash

# calc_settings
source: Calculation Settings
id: Pengaturan Perhitungan
uz: Hisoblash sozlamalari

# calc_method
source: Calculation Method
id: Metode Perhitungan
uz: Hisoblash usuli

# madhab_title
source: Madhab (for Asr time)
id: Mazhab (untuk waktu Ashar)
uz: Mazhab (Asr vaqti uchun)

source: Hanafi
uz: Hanafiy

# shafi
source: Shafi'i / Others
id: Syafi'i / Lainnya
uz: Shofiiy / Boshqa

# gps_enabled
source: GPS location enabled
id: Lokasi GPS diaktifkan
uz: GPS orqali joylashuv yoqildi

# quyosh
source: Sunrise
id: Terbit
uz: Quyosh

# qibla_aligned
source: You are aligned to Qibla!
id: Kiblat telah lurus!
uz: Qibla yo'nalishidasiz!

# qibla_hint
source: Hold your phone flat and turn slowly
id: Pegang ponsel Anda dengan datar dan putar perlahan
uz: Telefoningizni tekis ushlang va sekin aylantiring

# auto_detect_method
source: Auto Detection
id: Deteksi Otomatis
uz: Avtomatik aniqlash

# auto_detect_hint
source: Select method based on your country automatically
id: Otomatis memilih metode perhitungan yang sesuai
uz: Mamlakatga asoslangan holda mos usulni tanlash

# calc_method_hint
source: Different regions use different calculation standards. Choose the one that suits you.
id: Standar perhitungan berbeda di tiap wilayah. Pilih yang sesuai.
uz: Turli mintaqalar uchun turli hisoblash standartlari qo'llaniladi. O'zingizga mosini tanlang.

# location_denied
source: Location access denied
id: Akses lokasi ditolak
uz: Joylashuvga ruxsat berilmadi

# location_needed
source: Location access is needed
id: Akses lokasi diperlukan
uz: Joylashuvga ruxsat kerak

source: Retry
id: Coba lagi
uz: Qayta urinish

source: Today
id: Hari Ini
uz: Bugun

source: Streak
id: Beruntun
uz: Davomiylik

source: All
id: Semua
uz: Jami

source: Last 7 days
id: 7 hari terakhir
uz: Oxirgi 7 kun

source: Mon
id: Sen
uz: Du

source: Tue
id: Sel
uz: Se

source: Wed
id: Rab
uz: Ch

source: Thu
id: Kam
uz: Pa

source: Fri
id: Jum
uz: Ju

source: Sat
id: Sab
uz: Sh

source: Sun
id: Min
uz: Ya

source: Monthly Schedule
id: Jadwal Bulanan
uz: 1 Oylik jadval

# prayer_completed
source: prayed
id: sudah shalat
uz: namoz o'qildi

source: Future times
id: Waktu akan datang
uz: Kelajak vaqtlari

source: Past day
id: Hari lalu
uz: O'tgan kun

source: Full Schedule
id: Jadwal Lengkap
uz: To'liq jadval

# completed_today
source: Today:
id: Hari ini:
uz: Bugun:

# of_5_prayers
source: / 5 prayers done
id: / 5 shalat diselesaikan
uz: / 5 namoz o'qildi

source: Daily Prayers
id: Shalat Harian
uz: Kunlik namozlar

# all_prayers_done
source: All prayers completed. May Allah accept.
id: Semua shalat diselesaikan. Semoga Allah menerima.
uz: Barcha namozlar o'qildi. Alloh qabul qilsin.

# home_greeting
source: As-salamu alaykum
id: Assalamu'alaikum
uz: Assalomu alaykum

# prayer_fajr
source: Fajr
id: Subuh
uz: Bomdod

# prayer_dhuhr
source: Dhuhr
id: Dzuhur
uz: Peshin

# prayer_maghrib
source: Maghrib
uz: Shom

# prayer_isha
source: Isha
id: Isya
uz: Xufton

# tasbeh_title
source: Tasbeeh
id: Tasbih
uz: Tasbeh

# analytics_title
source: Analytics
id: Statistik
uz: Statistika

# monthly_summary_title
source: Monthly Reflection
id: Refleksi Bulanan
uz: Oylik Tafakkur

# qaza_pending
source: Qaza
id: Qadha
uz: Qazo

# all_prayers_completed
source: All prayers completed. May Allah accept.
id: Semua shalat diselesaikan. Semoga Allah menerima.
uz: Barcha namozlar o'qildi. Alloh qabul qilsin.

# spiritual_message_high
source: Your consistency brings spiritual elevation.
id: Konsistensimu mendatangkan kedamaian spiritual.
uz: Izchilligingiz ruhiy yuksalish keltiradi.

# spiritual_message_medium
source: Every day is a new opportunity.
id: Setiap hari adalah peluang baru untuk dekat kepada-Nya.
uz: Har bir kun — yangi imkoniyat.

# spiritual_message_low
source: Gentle consistency strengthens the heart.
id: Keistiqomahan yang lembut akan menguatkan hati.
uz: Muloyim izchillik qalbni mustahkamlaydi.

source: Qibla
id: Kiblat

source: Asr
id: Ashar

# prayer_asr
source: Asr
id: Ashar

# qibla_title
source: Qibla
id: Kiblat
